{
  "TXXATX": 0,
  "AXXXAT": 1,
  "XAXAAX": 2,
  "XTXATT": 3,
  "AAXTXA": 4,
  "XAXTTX": 5,
  "AATXAT": 6,
  "ATTATA": 7,
  "TAATXT": 8,
  "TTXAAX": 9,
  "TXAAAA": 10,
  "TXTAXX": 11,
  "TXATTT": 12,
  "XTXTTT": 13,
  "TXTATT": 14,
  "XTAXAX": 15,
  "ATATXA": 16,
  "AXXTXA": 17,
  "TTTTXX": 18,
  "XATATX": 19,
  "TATTAA": 20,
  "TATXAT": 21,
  "AAXXXA": 22,
  "AAATAT": 23,
  "XAAXAX": 24,
  "AXAATX": 25,
  "TTTTTA": 26,
  "AAXXTA": 27,
  "XXATTT": 28,
  "TAAXXA": 29,
  "TATXXX": 30,
  "TXXTAX": 31,
  "XATTXT": 32,
  "XTAXTX": 33,
  "TTXTTA": 34,
  "TXTTAX": 35,
  "AXTTTX": 36,
  "XTXAXT": 37,
  "TXTAXA": 38,
  "ATTTXT": 39,
  "XXXTTT": 40,
  "TAATTA": 41,
  "XTAXXT": 42,
  "AXXXXX": 43,
  "ATAXTX": 44,
  "TTAXTX": 45,
  "AATTAT": 46,
  "XTXXAA": 47,
  "AAAXXA": 48,
  "XXXXTA": 49,
  "AXXTAT": 50,
  "XXTTTA": 51,
  "TXXTAA": 52,
  "XTATAX": 53,
  "ATTXXA": 54,
  "AXXXTX": 55,
  "AATTXT": 56,
  "TXXAAT": 57,
  "TAAATA": 58,
  "ATTXTX": 59,
  "XATTAX": 60,
  "XAAAAA": 61,
  "TATAAA": 62,
  "XTAAAA": 63,
  "TTXXAT": 64,
  "XTTXTX": 65,
  "TTTTAT": 66,
  "TXXXAT": 67,
  "AXXXXA": 68,
  "TTATTX": 69,
  "XXXAAT": 70,
  "TAXAAA": 71,
  "XTAATT": 72,
  "XAAATX": 73,
  "ATXAAT": 74,
  "XTTATA": 75,
  "AXAAAA": 76,
  "TXXXXA": 77,
  "XXTXAX": 78,
  "ATTAXT": 79,
  "XXAATA": 80,
  "XXXAXA": 81,
  "XAAATT": 82,
  "TXTTXT": 83,
  "XATXXT": 84,
  "XTATXA": 85,
  "AAAAXA": 86,
  "ATTATT": 87,
  "XXAXXA": 88,
  "AAXTXX": 89,
  "XTTATX": 90,
  "AXTTAX": 91,
  "TTXXTT": 92,
  "TTTXAX": 93,
  "XXXXXA": 94,
  "TTATTA": 95,
  "XXTAXA": 96,
  "XXXTAX": 97,
  "XAATAT": 98,
  "TXTTTA": 99,
  "AAATTT": 100,
  "AAATXA": 101,
  "TTXXTA": 102,
  "TTXTAT": 103,
  "TTTXXX": 104,
  "AXXATT": 105,
  "TAXXTX": 106,
  "XXXAAX": 107,
  "TXXTTX": 108,
  "AAAXXX": 109,
  "TTAXAT": 110,
  "AXAAAT": 111,
  "AXTATT": 112,
  "TXAATT": 113,
  "AAAXAA": 114,
  "TAXAXA": 115,
  "XXTXXT": 116,
  "XXXATX": 117,
  "AXXTTX": 118,
  "AXATXX": 119,
  "TAXTAA": 120,
  "XXTXAT": 121,
  "XAXXTA": 122,
  "XTXXAX": 123,
  "TXTAXT": 124,
  "XAXXXX": 125,
  "TATTTT": 126,
  "TTTATX": 127,
  "ATAAXT": 128,
  "TXATXA": 129,
  "XAXAAT": 130,
  "AAXAXT": 131,
  "XXTTXX": 132,
  "AAAAXT": 133,
  "ATATAX": 134,
  "TTTAXT": 135,
  "AXATAT": 136,
  "XAXTTA": 137,
  "XTXAXA": 138,
  "XTXXTX": 139,
  "ATXXXA": 140,
  "ATATTX": 141,
  "ATTXXX": 142,
  "TXAXAX": 143,
  "XAXTAT": 144,
  "XXXXAT": 145,
  "TAAXAA": 146,
  "ATXXAA": 147,
  "TAXTXX": 148,
  "XXATXA": 149,
  "XTXATA": 150,
  "TXXTTT": 151,
  "ATAATT": 152,
  "XTTXAT": 153,
  "TATTTA": 154,
  "TAXAAX": 155,
  "AAATTA": 156,
  "TXTAAT": 157,
  "TAAXTX": 158,
  "ATAAAT": 159,
  "XATAXX": 160,
  "TTXAXT": 161,
  "XTTAXX": 162,
  "XAAAXT": 163,
  "AXTATX": 164,
  "AAAATX": 165,
  "TAXTTX": 166,
  "XAAAAT": 167,
  "XXAAAT": 168,
  "XAXTAA": 169,
  "TTAAXA": 170,
  "ATAXAX": 171,
  "XTXAAX": 172,
  "TAAXXT": 173,
  "AAXXTT": 174,
  "TXATTA": 175,
  "XAXTXT": 176,
  "XAAAXX": 177,
  "AAXXTX": 178,
  "ATAAXA": 179,
  "AXAXTX": 180,
  "XTTTXA": 181,
  "AXATXT": 182,
  "ATTTTX": 183,
  "XXTAXT": 184,
  "XAXXXT": 185,
  "TTAXAA": 186,
  "TXXXXX": 187,
  "TAXXAT": 188,
  "XTXAAA": 189,
  "AXXXXT": 190,
  "ATXTXX": 191,
  "XATXTT": 192,
  "TATXAX": 193,
  "XAXXAX": 194,
  "AXTXTX": 195,
  "XAXAAA": 196,
  "XAATAX": 197,
  "XTAXXX": 198,
  "XTAATX": 199,
  "XTTXAA": 200,
  "XAAAAX": 201,
  "XXAAXT": 202,
  "XAATAA": 203,
  "XXAXTT": 204,
  "AXTTXX": 205,
  "XXTTAA": 206,
  "XXXXAA": 207,
  "XXXTXA": 208,
  "TAXXTT": 209,
  "AAATXT": 210,
  "TTTATT": 211,
  "TTAXTT": 212,
  "ATTXAT": 213,
  "TXAXXA": 214,
  "TAAAAA": 215,
  "AXTXAX": 216,
  "XXXATT": 217,
  "TTATXX": 218,
  "AAATAX": 219,
  "TXAATA": 220,
  "TATAXT": 221,
  "XTXTAT": 222,
  "TTAATX": 223,
  "TXXXTA": 224,
  "ATTTXA": 225,
  "TAXTTA": 226,
  "XTTTTA": 227,
  "TTXTXT": 228,
  "AAXTAA": 229,
  "TTAXXA": 230,
  "TAAAAT": 231,
  "XXTTTT": 232,
  "AATXXT": 233,
  "AATATA": 234,
  "ATAXXT": 235,
  "AAXXXX": 236,
  "TTXXXA": 237,
  "TTTAAX": 238,
  "TTXAXA": 239,
  "TXTXXX": 240,
  "XXXTAA": 241,
  "TAAATX": 242,
  "XXATAX": 243,
  "TTAXAX": 244,
  "TAATXA": 245,
  "AXAXTA": 246,
  "XTXTAX": 247,
  "AXXAXT": 248,
  "TAAAXA": 249,
  "XXTTAX": 250,
  "AAXXAX": 251,
  "TXAAAX": 252,
  "XTAXTT": 253,
  "XTAAXA": 254,
  "AAXAXA": 255,
  "TXXAXT": 256,
  "TXXATA": 257,
  "XXATAA": 258,
  "TAAXTT": 259,
  "TTXTXX": 260,
  "ATXTAX": 261,
  "XTTXTT": 262,
  "AATTAA": 263,
  "TXAXTX": 264,
  "ATXXTA": 265,
  "AAXAAA": 266,
  "XXATTX": 267,
  "XTAAXT": 268,
  "AAAXTX": 269,
  "TXAAXX": 270,
  "AAAXAX": 271,
  "XXXAXX": 272,
  "AXAXXX": 273,
  "AXAAXX": 274,
  "TXTAAA": 275,
  "TTTATA": 276,
  "TAXAAT": 277,
  "TXTAAX": 278,
  "AAXXAT": 279,
  "TATAAT": 280,
  "AXAXAT": 281,
  "XATTAT": 282,
  "TTXTXA": 283,
  "XTXTAA": 284,
  "AAAAXX": 285,
  "TTAXTA": 286,
  "XTAAAX": 287,
  "XXTXTA": 288,
  "TATXXT": 289,
  "TXATTX": 290,
  "XAXXXA": 291,
  "XXAXAA": 292,
  "XAXAXA": 293,
  "TAATAA": 294,
  "XXTTXT": 295,
  "ATTXTT": 296,
  "ATTTAX": 297,
  "XATATA": 298,
  "ATXAXT": 299,
  "XATTTX": 300,
  "AXXXTT": 301,
  "AATTXX": 302,
  "XTTTTX": 303,
  "XAXATA": 304,
  "TAAAAX": 305,
  "XAXXAT": 306,
  "XTATAA": 307,
  "TAAXXX": 308,
  "AAAAAX": 309,
  "XAXXTT": 310,
  "TATATA": 311,
  "TTATAT": 312,
  "AXXAAX": 313,
  "TXXXAX": 314,
  "XTTAAT": 315,
  "TAXXXT": 316,
  "AATTTA": 317,
  "ATATXX": 318,
  "ATATTT": 319,
  "AATXAA": 320,
  "TXTXXT": 321,
  "ATAATA": 322,
  "XXXTTX": 323,
  "TATTXX": 324,
  "XAAXAA": 325,
  "AXTTXT": 326,
  "XATAXA": 327,
  "TXAAXT": 328,
  "XAAXTT": 329,
  "XATAAT": 330,
  "TTAAXX": 331,
  "TXAAAT": 332,
  "AAXAXX": 333,
  "AAAXTT": 334,
  "TATATT": 335,
  "AAATAA": 336,
  "TXAXTA": 337,
  "ATXTXT": 338,
  "AXXTXX": 339,
  "XTXTTA": 340,
  "TTTTAX": 341,
  "AXTAAT": 342,
  "TTTXTT": 343,
  "XATTAA": 344,
  "TXAXAT": 345,
  "AATAAX": 346,
  "AAAXXT": 347,
  "ATXTTX": 348,
  "XTATTA": 349,
  "ATXTTT": 350,
  "XXTXXA": 351,
  "XTTTAX": 352,
  "TXXXXT": 353,
  "ATAXTA": 354,
  "AXXAXA": 355,
  "XAXATT": 356,
  "AXTAAX": 357,
  "TTTAXA": 358,
  "XXTAAX": 359,
  "AXAXTT": 360,
  "TATTAT": 361,
  "AXXXTA": 362,
  "XATXAA": 363,
  "XATAAX": 364,
  "TTXAAA": 365,
  "XXXAXT": 366,
  "XXATTA": 367,
  "XXTXXX": 368,
  "XTATAT": 369,
  "TXTXXA": 370,
  "ATXXTT": 371,
  "TXTTTX": 372,
  "TXTTAA": 373,
  "TXAXXT": 374,
  "TTTAXX": 375,
  "XAAXAT": 376,
  "AATATX": 377,
  "XATXXX": 378,
  "TXXXTX": 379,
  "XAAXXA": 380,
  "ATXTAT": 381,
  "AXATTX": 382,
  "TTXATA": 383,
  "XAXTTT": 384,
  "XTAATA": 385,
  "XAAXXX": 386,
  "AXTAXX": 387,
  "TTTTTX": 388,
  "XTXXXA": 389,
  "ATXATX": 390,
  "TXATAT": 391,
  "XXAXAT": 392,
  "AAXTTX": 393,
  "TAXAXX": 394,
  "XTTAAX": 395,
  "TXAAXA": 396,
  "XATXAT": 397,
  "TTXXXT": 398,
  "ATTAAT": 399,
  "AXTAAA": 400,
  "AAAAAT": 401,
  "TXAATX": 402,
  "ATXXTX": 403,
  "XTATXT": 404,
  "TAXATA": 405,
  "AXTAXA": 406,
  "XXTXTT": 407,
  "XATAXT": 408,
  "XXAXAX": 409,
  "XTTTAA": 410,
  "XXAXTX": 411,
  "XATXTA": 412,
  "TXXTTA": 413,
  "XXTAAT": 414,
  "TAXTXA": 415,
  "TXXTAT": 416,
  "ATATAT": 417,
  "AXXTAA": 418,
  "TAXXXX": 419,
  "AATATT": 420,
  "AXATAX": 421,
  "TAXXAX": 422,
  "AAXTXT": 423,
  "XXXTXX": 424,
  "TXXAXA": 425,
  "AXAAXA": 426,
  "AXTXXT": 427,
  "TTXAAT": 428,
  "XXTAXX": 429,
  "XXTAAA": 430,
  "TXXTXA": 431,
  "TATTAX": 432,
  "XAXTAX": 433,
  "ATTXAA": 434,
  "XATTXA": 435,
  "ATTTAA": 436,
  "XTTXXT": 437,
  "AXXAAT": 438,
  "XTTXXX": 439,
  "TTXXAA": 440,
  "TTXXAX": 441,
  "XTAXAT": 442,
  "XATXTX": 443,
  "AXTTTT": 444,
  "XTXATX": 445,
  "XTXAAT": 446,
  "ATXAXX": 447,
  "XXXATA": 448,
  "AATAXA": 449,
  "ATAXTT": 450,
  "XTTAXA": 451,
  "XXTXTX": 452,
  "AAAXAT": 453,
  "TXTTTT": 454,
  "TXTTXA": 455,
  "TXTATX": 456,
  "TXXXAA": 457,
  "ATAXXA": 458,
  "ATXTXA": 459,
  "AATXTT": 460,
  "XAATXA": 461,
  "XXXXAX": 462,
  "XTXTXT": 463,
  "AXTATA": 464,
  "TTATXT": 465,
  "AATTTX": 466,
  "ATTAXA": 467,
  "AXATAA": 468,
  "XXATXX": 469,
  "XTTTTT": 470,
  "AXXXAX": 471,
  "XXXTXT": 472,
  "XAAXXT": 473,
  "XAATTT": 474,
  "TTXATT": 475,
  "XXXXXT": 476,
  "TATTXA": 477,
  "TXATAX": 478,
  "TTXTTX": 479,
  "TXATXT": 480,
  "XAXXAA": 481,
  "AXXAXX": 482,
  "AXXXAA": 483,
  "XXXXTT": 484,
  "ATAATX": 485,
  "TXTXTT": 486,
  "TAXXXA": 487,
  "AXAXAX": 488,
  "TAXTAX": 489,
  "AAXTTT": 490,
  "AATAXX": 491,
  "TTXTAX": 492,
  "XTXXXX": 493,
  "TAATTX": 494,
  "XTTXXA": 495,
  "XTXXXT": 496,
  "XTXAXX": 497,
  "AXAATT": 498,
  "TAXTTT": 499,
  "TXATAA": 500,
  "ATXAXA": 501,
  "AAAATT": 502,
  "AATAAT": 503,
  "AXTXXX": 504,
  "XXXXTX": 505,
  "XAATTX": 506,
  "AXXATX": 507,
  "ATXTTA": 508,
  "XTTTXX": 509,
  "TTAXXX": 510,
  "XAXXTX": 511,
  "AXAATA": 512,
  "ATTAXX": 513,
  "XTXTXA": 514,
  "XATTTA": 515,
  "XAATXX": 516,
  "AAXAAT": 517,
  "TTXAXX": 518,
  "XTTXTA": 519,
  "XTAXAA": 520,
  "TAAXAX": 521,
  "AATXTX": 522,
  "AAXATA": 523,
  "AAAAAA": 524,
  "TTTTXA": 525,
  "XATATT": 526,
  "ATAXAT": 527,
  "TAATTT": 528,
  "ATATXT": 529,
  "AXXTXT": 530,
  "TATTTX": 531,
  "XTXXAT": 532,
  "XTTAXT": 533,
  "TXTATA": 534,
  "TXTTAT": 535,
  "TATAXX": 536,
  "TAXTAT": 537,
  "XXXXXX": 538,
  "ATXATT": 539,
  "AXATXA": 540,
  "XTATTT": 541,
  "TTATAA": 542,
  "XATAAA": 543,
  "TAATXX": 544,
  "AAAXTA": 545,
  "XXXAAA": 546,
  "TXTXTA": 547,
  "ATXAAA": 548,
  "XAXAXT": 549,
  "XXATAT": 550,
  "TTAAAA": 551,
  "XTAAXX": 552,
  "XTAXTA": 553,
  "XXAAAA": 554,
  "XXATXT": 555,
  "XATTTT": 556,
  "TXXTXT": 557,
  "TTAXXT": 558,
  "XXXTTA": 559,
  "XTXXTA": 560,
  "AXXAAA": 561,
  "ATAAAA": 562,
  "AAXXAA": 563,
  "AXXTTA": 564,
  "TAAXAT": 565,
  "XTTAAA": 566,
  "XAXATX": 567,
  "TTATTT": 568,
  "AXTXAT": 569,
  "ATXXXX": 570,
  "XXTATX": 571,
  "AXAAXT": 572,
  "XTAAAT": 573,
  "TATXAA": 574,
  "XXTATA": 575,
  "AXTTXA": 576,
  "TXXXTT": 577,
  "TTXXTX": 578,
  "AXTXTT": 579,
  "AAXXXT": 580,
  "AATXAX": 581,
  "ATTXTA": 582,
  "TTATAX": 583,
  "TXXATT": 584,
  "TTTAAA": 585,
  "TTTXTX": 586,
  "AXTXTA": 587,
  "TTTXTA": 588,
  "XXTTAT": 589,
  "TXTXAX": 590,
  "TAXAXT": 591,
  "AAATTX": 592,
  "XAAATA": 593,
  "XXAXTA": 594,
  "TTXTTT": 595,
  "ATXATA": 596,
  "XAAXTA": 597,
  "XAAXTX": 598,
  "TTAATA": 599,
  "TATTXT": 600,
  "XTAXXA": 601,
  "ATTTAT": 602,
  "XXAXXT": 603,
  "XXAATX": 604,
  "AXAXXT": 605,
  "TXTXAA": 606,
  "TAATAX": 607,
  "AATAXT": 608,
  "AAXTAT": 609,
  "AAXAAX": 610,
  "AAXATX": 611,
  "TXATXX": 612,
  "TTTXXA": 613,
  "XATXXA": 614,
  "ATXAAX": 615,
  "ATATAA": 616,
  "AXXTAX": 617,
  "TAXATX": 618,
  "AXAXAA": 619,
  "TATXTT": 620,
  "ATXXAT": 621,
  "XTXTTX": 622,
  "TXXAAA": 623,
  "XTTTXT": 624,
  "XXAATT": 625,
  "XAXTXX": 626,
  "TXTXTX": 627,
  "ATTTXX": 628,
  "XTATTX": 629,
  "TAXATT": 630,
  "TXAXAA": 631,
  "AAXTTA": 632,
  "XTXTXX": 633,
  "TTAATT": 634,
  "ATXXXT": 635,
  "XTTTAT": 636,
  "TATXXA": 637,
  "AXXTTT": 638,
  "ATAXAA": 639,
  "TTATXA": 640,
  "ATTAAA": 641,
  "XAXTXA": 642,
  "AXXATA": 643,
  "ATTTTT": 644,
  "AXATTA": 645,
  "AXAXXA": 646,
  "AXTTAA": 647,
  "TTTXAA": 648,
  "XTXXTT": 649,
  "TTTXXT": 650,
  "TAXTXT": 651,
  "TXTXAT": 652,
  "AXATTT": 653,
  "TTXATX": 654,
  "XXAAXX": 655,
  "AATTAX": 656,
  "TATATX": 657,
  "TATXTX": 658,
  "AXTXXA": 659,
  "AXTXAA": 660,
  "TXXAAX": 661,
  "ATTATX": 662,
  "XXTTXA": 663,
  "XTATXX": 664,
  "TTTTXT": 665,
  "AATTXA": 666,
  "TTAAAT": 667,
  "TXXTXX": 668,
  "TAATAT": 669,
  "XAATXT": 670,
  "ATATTA": 671,
  "XXTTTX": 672,
  "TAAATT": 673,
  "XAATTA": 674,
  "ATTXAX": 675,
  "XXXTAT": 676,
  "ATAXXX": 677,
  "TAXXTA": 678,
  "AAATXX": 679,
  "TTTTTT": 680,
  "TAXXAA": 681,
  "TAAAXT": 682,
  "ATTXXT": 683,
  "XTTATT": 684,
  "XATTXX": 685,
  "AATXXA": 686,
  "AXAAAX": 687,
  "TTAAAX": 688,
  "AXTAXT": 689,
  "TAAXTA": 690,
  "XXAXXX": 691,
  "XATXAX": 692,
  "TTTAAT": 693,
  "XXTXAA": 694,
  "AAXTAX": 695,
  "ATXTAA": 696,
  "TXXAXX": 697,
  "TTTXAT": 698,
  "ATTAAX": 699,
  "XXAAXA": 700,
  "TATXTA": 701,
  "ATTTTA": 702,
  "TTAAXT": 703,
  "ATXXAX": 704,
  "TXAXXX": 705,
  "XXTATT": 706,
  "XXAAAX": 707,
  "AXTTAT": 708,
  "TAAAXX": 709,
  "XTTXAX": 710,
  "TTXTAA": 711,
  "AATXTA": 712,
  "TATAAX": 713,
  "XAXAXX": 714,
  "TXTTXX": 715,
  "AATTTT": 716,
  "AAAATA": 717,
  "AXTTTA": 718,
  "ATAAXX": 719,
  "AAXATT": 720,
  "TATAXA": 721,
  "AATXXX": 722,
  "TTXXXX": 723,
  "XAAAXA": 724,
  "AATAAA": 725,
  "TTTTAA": 726,
  "ATAAAX": 727,
  "TXAXTT": 728
}