{
  "G.3942": 0,
  "C.5513": 1,
  "T.9781": 2,
  "G.1762": 3,
  "G.3191": 4,
  "C.3529": 5,
  "G.6431": 6,
  "T.9330": 7,
  "235XXX": 8,
  "T.1631": 9,
  "A.8258": 10,
  "G.8896": 11,
  "C.3052": 12,
  "A.8170": 13,
  "A.7081": 14,
  "G.7259": 15,
  "A.6646": 16,
  "X.8244": 17,
  "T.8540": 18,
  "A.5318": 19,
  "A.5522": 20,
  "G.5913": 21,
  "T.2120": 22,
  "T.9880": 23,
  "315XXX": 24,
  "T.7874": 25,
  "A.8825": 26,
  "954XXX": 27,
  "X.2091": 28,
  "C.2567": 29,
  "G.6876": 30,
  "A.9039": 31,
  "X.2466": 32,
  "X.3198": 33,
  "028XXX": 34,
  "T.8529": 35,
  "X.566X": 36,
  "C.8470": 37,
  "A.574X": 38,
  "C.3236": 39,
  "G.2361": 40,
  "G.2767": 41,
  "T.8276": 42,
  "T.8681": 43,
  "C.8768": 44,
  "G.638X": 45,
  "C.8812": 46,
  "T.4771": 47,
  "C.4170": 48,
  "C.8128": 49,
  "G.1279": 50,
  "C.523X": 51,
  "X.7251": 52,
  "G.5807": 53,
  "G.6219": 54,
  "G.6908": 55,
  "X.1008": 56,
  "A.763X": 57,
  "C.1419": 58,
  "C.4868": 59,
  "G.3975": 60,
  "A.5614": 61,
  "T.8670": 62,
  "C.6526": 63,
  "G.3273": 64,
  "T.6270": 65,
  "X.3994": 66,
  "A.362X": 67,
  "C.4320": 68,
  "C.8260": 69,
  "A.5831": 70,
  "C.9514": 71,
  "X.531X": 72,
  "A.2314": 73,
  "X.6261": 74,
  "C.3409": 75,
  "C.2575": 76,
  "T.8834": 77,
  "A.2437": 78,
  "G.4563": 79,
  "C.6340": 80,
  "G.8424": 81,
  "G.2257": 82,
  "G.8537": 83,
  "X.9716": 84,
  "A.1807": 85,
  "T.3443": 86,
  "G.3700": 87,
  "A.7264": 88,
  "C.291X": 89,
  "G.2259": 90,
  "G.5179": 91,
  "A.439X": 92,
  "A.1887": 93,
  "G.1218": 94,
  "G.6182": 95,
  "G.3577": 96,
  "C.1386": 97,
  "T.5317": 98,
  "T.5381": 99,
  "A.2004": 100,
  "C.7703": 101,
  "T.8001": 102,
  "A.8244": 103,
  "C.1605": 104,
  "X.6561": 105,
  "T.1748": 106,
  "C.2492": 107,
  "C.3612": 108,
  "C.8630": 109,
  "A.687X": 110,
  "T.5395": 111,
  "C.3698": 112,
  "G.5668": 113,
  "X.3094": 114,
  "C.1489": 115,
  "A.2496": 116,
  "A.2903": 117,
  "A.474X": 118,
  "X.5406": 119,
  "G.4933": 120,
  "A.9518": 121,
  "X.2292": 122,
  "X.6477": 123,
  "C.2250": 124,
  "X.2922": 125,
  "C.2748": 126,
  "A.7616": 127,
  "C.7941": 128,
  "T.6148": 129,
  "G.5831": 130,
  "C.8927": 131,
  "G.3230": 132,
  "A.7003": 133,
  "A.6564": 134,
  "G.291X": 135,
  "C.3712": 136,
  "C.9420": 137,
  "X.95XX": 138,
  "G.6089": 139,
  "X.8975": 140,
  "X.6719": 141,
  "A.4224": 142,
  "A.1290": 143,
  "X.8503": 144,
  "A.5270": 145,
  "T.9254": 146,
  "A.6060": 147,
  "X.6433": 148,
  "G.4315": 149,
  "C.6855": 150,
  "G.6419": 151,
  "G.7435": 152,
  "G.3308": 153,
  "A.5493": 154,
  "X.7347": 155,
  "G.212X": 156,
  "G.7999": 157,
  "G.363X": 158,
  "A.6752": 159,
  "C.6774": 160,
  "T.9955": 161,
  "T.7962": 162,
  "T.2941": 163,
  "G.5138": 164,
  "T.2385": 165,
  "G.5873": 166,
  "T.7252": 167,
  "A.1195": 168,
  "C.4052": 169,
  "T.9555": 170,
  "T.5854": 171,
  "G.1422": 172,
  "A.6158": 173,
  "T.3925": 174,
  "C.5208": 175,
  "X.7148": 176,
  "G.2983": 177,
  "T.4295": 178,
  "T.1972": 179,
  "A.5017": 180,
  "T.4622": 181,
  "C.3957": 182,
  "T.2867": 183,
  "T.323X": 184,
  "G.835X": 185,
  "C.6297": 186,
  "A.85XX": 187,
  "G.7434": 188,
  "G.4287": 189,
  "G.8014": 190,
  "G.8455": 191,
  "G.4206": 192,
  "T.4079": 193,
  "T.8510": 194,
  "X.401X": 195,
  "C.8825": 196,
  "X.9553": 197,
  "C.5757": 198,
  "C.6446": 199,
  "T.2207": 200,
  "A.5293": 201,
  "T.4821": 202,
  "X.7676": 203,
  "T.167X": 204,
  "A.6811": 205,
  "X.6065": 206,
  "G.7164": 207,
  "X.978X": 208,
  "T.651X": 209,
  "G.8818": 210,
  "G.6669": 211,
  "T.7850": 212,
  "A.7520": 213,
  "G.7219": 214,
  "A.6831": 215,
  "C.8381": 216,
  "A.6960": 217,
  "A.2159": 218,
  "C.7461": 219,
  "X.7193": 220,
  "T.1738": 221,
  "A.8845": 222,
  "T.7406": 223,
  "X.1579": 224,
  "X.4763": 225,
  "G.1786": 226,
  "A.5949": 227,
  "C.6817": 228,
  "T.7366": 229,
  "A.7718": 230,
  "G.6703": 231,
  "T.3195": 232,
  "A.5381": 233,
  "A.6884": 234,
  "A.926X": 235,
  "G.9445": 236,
  "G.2954": 237,
  "X.578X": 238,
  "G.1944": 239,
  "X.4865": 240,
  "T.2776": 241,
  "X.2226": 242,
  "A.2522": 243,
  "T.5056": 244,
  "A.4250": 245,
  "T.247X": 246,
  "G.5556": 247,
  "G.6150": 248,
  "G.788X": 249,
  "X.3149": 250,
  "C.287X": 251,
  "A.5117": 252,
  "X.9184": 253,
  "A.1715": 254,
  "X.8031": 255,
  "T.4159": 256,
  "G.9971": 257,
  "G.1116": 258,
  "T.2602": 259,
  "C.6206": 260,
  "C.1249": 261,
  "G.3190": 262,
  "C.5553": 263,
  "G.4190": 264,
  "X.6040": 265,
  "T.117X": 266,
  "X.4607": 267,
  "A.5213": 268,
  "X.5485": 269,
  "A.3605": 270,
  "X.5168": 271,
  "A.2320": 272,
  "A.2870": 273,
  "C.1758": 274,
  "G.3239": 275,
  "T.7039": 276,
  "T.9260": 277,
  "T.3915": 278,
  "G.1518": 279,
  "A.7069": 280,
  "A.2756": 281,
  "X.2808": 282,
  "T.7458": 283,
  "C.7883": 284,
  "X.3275": 285,
  "G.8607": 286,
  "T.3570": 287,
  "C.5530": 288,
  "A.1189": 289,
  "C.7393": 290,
  "A.9166": 291,
  "X.5759": 292,
  "G.4140": 293,
  "X.554X": 294,
  "C.3691": 295,
  "G.5528": 296,
  "X.8039": 297,
  "969XXX": 298,
  "T.4291": 299,
  "C.4490": 300,
  "G.2184": 301,
  "X.7149": 302,
  "T.484X": 303,
  "A.6326": 304,
  "X.3820": 305,
  "T.4572": 306,
  "C.129X": 307,
  "T.9320": 308,
  "G.2980": 309,
  "X.7006": 310,
  "X.21XX": 311,
  "T.2273": 312,
  "X.5684": 313,
  "C.268X": 314,
  "X.7002": 315,
  "X.7777": 316,
  "T.3736": 317,
  "T.375X": 318,
  "A.2610": 319,
  "G.7479": 320,
  "C.9897": 321,
  "T.7537": 322,
  "A.7133": 323,
  "G.6540": 324,
  "A.3044": 325,
  "T.2620": 326,
  "G.2355": 327,
  "A.9846": 328,
  "A.7496": 329,
  "T.3645": 330,
  "C.5946": 331,
  "A.6922": 332,
  "X.8907": 333,
  "A.3716": 334,
  "T.8353": 335,
  "G.2733": 336,
  "T.2403": 337,
  "T.9040": 338,
  "G.3150": 339,
  "A.945X": 340,
  "A.7228": 341,
  "G.5658": 342,
  "T.7303": 343,
  "C.5688": 344,
  "C.9750": 345,
  "T.8402": 346,
  "A.1151": 347,
  "C.2603": 348,
  "X.6946": 349,
  "X.2351": 350,
  "T.1923": 351,
  "X.1544": 352,
  "X.5591": 353,
  "T.8671": 354,
  "A.9957": 355,
  "T.1586": 356,
  "T.9668": 357,
  "X.888X": 358,
  "A.1147": 359,
  "X.7863": 360,
  "T.6963": 361,
  "X.3569": 362,
  "T.825X": 363,
  "A.8868": 364,
  "A.3800": 365,
  "X.2575": 366,
  "X.360X": 367,
  "A.4063": 368,
  "G.8026": 369,
  "C.9305": 370,
  "A.6509": 371,
  "G.7297": 372,
  "C.7159": 373,
  "G.7439": 374,
  "A.691X": 375,
  "X.2259": 376,
  "A.7683": 377,
  "X.949X": 378,
  "G.4794": 379,
  "X.1471": 380,
  "X.9131": 381,
  "X.4919": 382,
  "T.3876": 383,
  "X.1866": 384,
  "537XXX": 385,
  "T.3138": 386,
  "A.7297": 387,
  "G.2331": 388,
  "T.8618": 389,
  "X.4730": 390,
  "T.4976": 391,
  "X.453X": 392,
  "A.5291": 393,
  "A.9657": 394,
  "X.7823": 395,
  "X.9488": 396,
  "T.3551": 397,
  "T.5707": 398,
  "A.8515": 399,
  "C.1356": 400,
  "A.1353": 401,
  "T.8052": 402,
  "C.3803": 403,
  "C.2496": 404,
  "T.8939": 405,
  "X.7959": 406,
  "G.9739": 407,
  "A.7931": 408,
  "A.3176": 409,
  "A.6116": 410,
  "T.4605": 411,
  "T.961X": 412,
  "A.2049": 413,
  "G.7861": 414,
  "X.8989": 415,
  "T.2418": 416,
  "G.4149": 417,
  "C.209X": 418,
  "A.2388": 419,
  "C.9459": 420,
  "G.8605": 421,
  "X.2289": 422,
  "T.1877": 423,
  "T.687X": 424,
  "X.8537": 425,
  "T.71XX": 426,
  "T.8646": 427,
  "C.7382": 428,
  "T.680X": 429,
  "A.8100": 430,
  "X.6468": 431,
  "G.7503": 432,
  "T.7116": 433,
  "A.6487": 434,
  "G.4687": 435,
  "A.4730": 436,
  "A.1875": 437,
  "G.4992": 438,
  "C.4969": 439,
  "T.757X": 440,
  "X.8284": 441,
  "A.6283": 442,
  "C.6244": 443,
  "C.8091": 444,
  "X.3121": 445,
  "G.2925": 446,
  "T.3619": 447,
  "G.461X": 448,
  "A.3807": 449,
  "T.9253": 450,
  "X.9473": 451,
  "C.689X": 452,
  "T.5989": 453,
  "C.1742": 454,
  "C.1675": 455,
  "A.1521": 456,
  "C.812X": 457,
  "X.4649": 458,
  "C.1024": 459,
  "C.2509": 460,
  "C.325X": 461,
  "C.7563": 462,
  "C.9223": 463,
  "G.9494": 464,
  "X.3455": 465,
  "C.3360": 466,
  "C.5791": 467,
  "G.2823": 468,
  "T.3777": 469,
  "T.8433": 470,
  "A.2421": 471,
  "A.6918": 472,
  "C.1518": 473,
  "C.1994": 474,
  "G.2410": 475,
  "G.1092": 476,
  "X.5492": 477,
  "T.5070": 478,
  "C.7495": 479,
  "C.3885": 480,
  "G.2639": 481,
  "A.6886": 482,
  "X.6388": 483,
  "X.2583": 484,
  "C.2811": 485,
  "423XXX": 486,
  "A.1342": 487,
  "C.7105": 488,
  "T.2147": 489,
  "A.3626": 490,
  "C.3749": 491,
  "X.2210": 492,
  "G.8395": 493,
  "X.3649": 494,
  "C.9569": 495,
  "X.8483": 496,
  "T.3010": 497,
  "T.1960": 498,
  "G.7253": 499,
  "G.7731": 500,
  "G.3276": 501,
  "C.2326": 502,
  "G.2065": 503,
  "G.1700": 504,
  "C.2100": 505,
  "C.6101": 506,
  "X.5400": 507,
  "X.7634": 508,
  "X.3669": 509,
  "A.2282": 510,
  "C.9627": 511,
  "X.6804": 512,
  "A.3970": 513,
  "C.5238": 514,
  "X.2736": 515,
  "T.3872": 516,
  "G.6793": 517,
  "G.1770": 518,
  "A.8527": 519,
  "X.1475": 520,
  "T.456X": 521,
  "A.7726": 522,
  "A.9607": 523,
  "A.336X": 524,
  "C.4560": 525,
  "G.2461": 526,
  "C.3086": 527,
  "G.7283": 528,
  "X.3266": 529,
  "A.2423": 530,
  "A.1614": 531,
  "C.307X": 532,
  "C.3768": 533,
  "C.3514": 534,
  "G.8374": 535,
  "C.4427": 536,
  "A.9263": 537,
  "G.148X": 538,
  "G.4731": 539,
  "G.7683": 540,
  "G.8294": 541,
  "T.6663": 542,
  "T.9652": 543,
  "X.7887": 544,
  "C.849X": 545,
  "X.9902": 546,
  "C.7116": 547,
  "C.5048": 548,
  "T.9272": 549,
  "G.9488": 550,
  "C.5123": 551,
  "A.1229": 552,
  "C.1591": 553,
  "C.7061": 554,
  "C.8084": 555,
  "C.8928": 556,
  "T.6207": 557,
  "C.6656": 558,
  "G.9358": 559,
  "G.6591": 560,
  "X.7096": 561,
  "X.3255": 562,
  "G.5707": 563,
  "T.8977": 564,
  "A.6526": 565,
  "T.8431": 566,
  "T.3187": 567,
  "C.5810": 568,
  "X.6286": 569,
  "T.2627": 570,
  "G.8670": 571,
  "T.9282": 572,
  "A.2239": 573,
  "T.1408": 574,
  "A.1280": 575,
  "C.1121": 576,
  "T.5607": 577,
  "T.43XX": 578,
  "A.9097": 579,
  "T.2241": 580,
  "T.3335": 581,
  "A.7847": 582,
  "C.2456": 583,
  "C.697X": 584,
  "G.2906": 585,
  "G.5587": 586,
  "X.2319": 587,
  "G.8495": 588,
  "X.2533": 589,
  "610XXX": 590,
  "X.6529": 591,
  "X.6621": 592,
  "X.9495": 593,
  "C.3220": 594,
  "T.3078": 595,
  "C.458X": 596,
  "T.5346": 597,
  "T.9133": 598,
  "C.8771": 599,
  "A.1630": 600,
  "G.7805": 601,
  "C.4829": 602,
  "G.9996": 603,
  "G.2017": 604,
  "T.4239": 605,
  "G.5288": 606,
  "A.4983": 607,
  "T.6380": 608,
  "X.8387": 609,
  "X.7843": 610,
  "T.7338": 611,
  "C.6711": 612,
  "T.8122": 613,
  "G.1961": 614,
  "C.1498": 615,
  "G.7900": 616,
  "T.5546": 617,
  "T.8374": 618,
  "T.2619": 619,
  "T.7429": 620,
  "X.1496": 621,
  "G.3511": 622,
  "C.4256": 623,
  "T.1835": 624,
  "T.2942": 625,
  "X.3911": 626,
  "T.8715": 627,
  "A.5126": 628,
  "X.6902": 629,
  "G.9879": 630,
  "G.6176": 631,
  "C.7046": 632,
  "X.5370": 633,
  "A.8948": 634,
  "57XXXX": 635,
  "T.6025": 636,
  "A.3586": 637,
  "757XXX": 638,
  "X.5993": 639,
  "X.9556": 640,
  "T.6896": 641,
  "X.1126": 642,
  "A.4219": 643,
  "G.1579": 644,
  "G.9645": 645,
  "X.4737": 646,
  "X.878X": 647,
  "A.5573": 648,
  "A.5191": 649,
  "G.5194": 650,
  "C.7929": 651,
  "X.9508": 652,
  "G.3639": 653,
  "T.4179": 654,
  "249XXX": 655,
  "X.276X": 656,
  "X.1741": 657,
  "G.8264": 658,
  "T.7269": 659,
  "763XXX": 660,
  "G.15XX": 661,
  "T.2563": 662,
  "T.3937": 663,
  "X.4648": 664,
  "C.6067": 665,
  "X.8014": 666,
  "T.1114": 667,
  "G.4229": 668,
  "T.6041": 669,
  "X.513X": 670,
  "T.8719": 671,
  "G.6341": 672,
  "T.3533": 673,
  "X.2830": 674,
  "G.5472": 675,
  "C.9770": 676,
  "C.4627": 677,
  "T.2764": 678,
  "A.8752": 679,
  "A.1404": 680,
  "A.95XX": 681,
  "C.7711": 682,
  "A.9202": 683,
  "C.1117": 684,
  "C.9039": 685,
  "T.4909": 686,
  "C.8793": 687,
  "C.6566": 688,
  "X.1487": 689,
  "A.5697": 690,
  "G.8388": 691,
  "C.412X": 692,
  "T.4660": 693,
  "C.8043": 694,
  "C.5695": 695,
  "G.6903": 696,
  "A.5684": 697,
  "A.1561": 698,
  "X.8838": 699,
  "A.7652": 700,
  "T.519X": 701,
  "G.4108": 702,
  "A.6584": 703,
  "A.2452": 704,
  "X.5289": 705,
  "T.3738": 706,
  "G.9546": 707,
  "X.8787": 708,
  "X.8458": 709,
  "T.3082": 710,
  "G.9963": 711,
  "C.8404": 712,
  "T.8999": 713,
  "C.7940": 714,
  "A.191X": 715,
  "C.5185": 716,
  "C.1702": 717,
  "C.7254": 718,
  "C.2625": 719,
  "A.8031": 720,
  "A.8207": 721,
  "X.5644": 722,
  "A.3326": 723,
  "A.4670": 724,
  "034XXX": 725,
  "X.4122": 726,
  "C.5308": 727,
  "T.7372": 728,
  "T.404X": 729,
  "G.1186": 730,
  "C.1985": 731,
  "G.4815": 732,
  "C.1588": 733,
  "T.1498": 734,
  "X.8484": 735,
  "T.4897": 736,
  "T.7732": 737,
  "C.3273": 738,
  "T.2903": 739,
  "C.7472": 740,
  "G.1513": 741,
  "A.1742": 742,
  "T.6590": 743,
  "C.7915": 744,
  "C.5650": 745,
  "X.8289": 746,
  "C.4522": 747,
  "X.732X": 748,
  "T.8330": 749,
  "X.5451": 750,
  "A.3476": 751,
  "G.8812": 752,
  "T.6202": 753,
  "C.6986": 754,
  "G.4720": 755,
  "G.3393": 756,
  "G.3532": 757,
  "C.6176": 758,
  "A.6480": 759,
  "A.6639": 760,
  "C.6937": 761,
  "C.8841": 762,
  "C.6677": 763,
  "T.4707": 764,
  "X.3975": 765,
  "T.6299": 766,
  "X.5706": 767,
  "X.8337": 768,
  "T.771X": 769,
  "G.6972": 770,
  "A.7209": 771,
  "X.2337": 772,
  "X.9511": 773,
  "X.7984": 774,
  "C.2990": 775,
  "G.9557": 776,
  "G.6897": 777,
  "C.4934": 778,
  "A.8847": 779,
  "G.8158": 780,
  "16XXXX": 781,
  "T.6769": 782,
  "G.11XX": 783,
  "C.1390": 784,
  "G.6615": 785,
  "T.2099": 786,
  "T.6513": 787,
  "A.8717": 788,
  "A.3858": 789,
  "X.8324": 790,
  "C.5232": 791,
  "A.7151": 792,
  "A.5718": 793,
  "T.7504": 794,
  "G.5530": 795,
  "G.3800": 796,
  "X.9176": 797,
  "C.4987": 798,
  "T.4798": 799,
  "G.4883": 800,
  "G.7141": 801,
  "A.1599": 802,
  "G.7657": 803,
  "X.834X": 804,
  "A.3329": 805,
  "A.3675": 806,
  "G.8994": 807,
  "C.1180": 808,
  "G.13XX": 809,
  "C.615X": 810,
  "A.4761": 811,
  "A.5628": 812,
  "G.8824": 813,
  "T.4758": 814,
  "X.7466": 815,
  "T.3385": 816,
  "G.4037": 817,
  "X.2068": 818,
  "T.9508": 819,
  "778XXX": 820,
  "T.6173": 821,
  "G.9857": 822,
  "C.9696": 823,
  "G.3848": 824,
  "X.4547": 825,
  "X.4202": 826,
  "A.2808": 827,
  "C.6858": 828,
  "C.297X": 829,
  "G.2551": 830,
  "G.7075": 831,
  "X.2555": 832,
  "G.9662": 833,
  "G.422X": 834,
  "C.4244": 835,
  "C.7300": 836,
  "C.6197": 837,
  "T.6846": 838,
  "X.20XX": 839,
  "X.2479": 840,
  "X.7872": 841,
  "X.581X": 842,
  "A.3576": 843,
  "T.8519": 844,
  "G.8237": 845,
  "G.9087": 846,
  "X.3268": 847,
  "T.9874": 848,
  "G.3774": 849,
  "C.7668": 850,
  "C.6093": 851,
  "A.7065": 852,
  "A.5977": 853,
  "C.2307": 854,
  "C.6616": 855,
  "A.7849": 856,
  "X.994X": 857,
  "G.3006": 858,
  "A.8787": 859,
  "X.4904": 860,
  "T.4499": 861,
  "T.8191": 862,
  "T.8896": 863,
  "795XXX": 864,
  "689XXX": 865,
  "X.697X": 866,
  "X.1293": 867,
  "T.1599": 868,
  "X.4822": 869,
  "A.50XX": 870,
  "X.8716": 871,
  "C.7596": 872,
  "T.524X": 873,
  "766XXX": 874,
  "T.2337": 875,
  "A.3693": 876,
  "C.1487": 877,
  "G.1758": 878,
  "T.4963": 879,
  "T.4990": 880,
  "X.6487": 881,
  "G.6203": 882,
  "T.1347": 883,
  "T.1939": 884,
  "T.735X": 885,
  "C.675X": 886,
  "X.8526": 887,
  "693XXX": 888,
  "C.9761": 889,
  "A.4571": 890,
  "A.6816": 891,
  "G.7134": 892,
  "G.4803": 893,
  "G.7673": 894,
  "G.348X": 895,
  "T.557X": 896,
  "G.2720": 897,
  "X.1232": 898,
  "A.340X": 899,
  "A.394X": 900,
  "C.3211": 901,
  "X.4978": 902,
  "X.8226": 903,
  "G.1915": 904,
  "C.8816": 905,
  "C.9786": 906,
  "G.6437": 907,
  "T.3060": 908,
  "T.892X": 909,
  "C.2466": 910,
  "X.5928": 911,
  "A.229X": 912,
  "T.4362": 913,
  "G.4904": 914,
  "T.6632": 915,
  "T.3523": 916,
  "C.7131": 917,
  "T.8496": 918,
  "C.189X": 919,
  "X.4815": 920,
  "G.594X": 921,
  "C.5276": 922,
  "X.2118": 923,
  "C.2068": 924,
  "G.3934": 925,
  "C.4655": 926,
  "X.3960": 927,
  "C.2291": 928,
  "T.3766": 929,
  "T.5670": 930,
  "G.5678": 931,
  "T.5224": 932,
  "G.8023": 933,
  "C.5068": 934,
  "X.2375": 935,
  "X.6306": 936,
  "A.3503": 937,
  "C.5907": 938,
  "X.5906": 939,
  "G.4103": 940,
  "G.7523": 941,
  "X.6924": 942,
  "X.3391": 943,
  "C.3640": 944,
  "X.7356": 945,
  "C.7639": 946,
  "X.9514": 947,
  "A.7612": 948,
  "G.2562": 949,
  "C.5980": 950,
  "X.2113": 951,
  "X.3546": 952,
  "A.9007": 953,
  "G.3530": 954,
  "C.6983": 955,
  "X.8723": 956,
  "A.1118": 957,
  "A.2416": 958,
  "X.1947": 959,
  "C.9597": 960,
  "T.6076": 961,
  "C.1033": 962,
  "T.8111": 963,
  "C.3300": 964,
  "A.799X": 965,
  "A.3042": 966,
  "C.8433": 967,
  "X.136X": 968,
  "T.4002": 969,
  "C.6932": 970,
  "T.1736": 971,
  "C.9403": 972,
  "T.8761": 973,
  "474XXX": 974,
  "G.1345": 975,
  "C.1251": 976,
  "A.5314": 977,
  "G.6080": 978,
  "A.6333": 979,
  "A.903X": 980,
  "C.6307": 981,
  "A.8255": 982,
  "C.9924": 983,
  "T.3251": 984,
  "T.1025": 985,
  "X.8924": 986,
  "X.7307": 987,
  "G.7707": 988,
  "A.7457": 989,
  "C.8963": 990,
  "C.5841": 991,
  "C.7016": 992,
  "C.8347": 993,
  "A.3645": 994,
  "T.2766": 995,
  "T.4723": 996,
  "X.9067": 997,
  "A.7743": 998,
  "866XXX": 999,
  "T.6454": 1000,
  "X.4973": 1001,
  "X.1867": 1002,
  "A.9116": 1003,
  "A.9711": 1004,
  "A.3428": 1005,
  "C.1835": 1006,
  "C.9126": 1007,
  "G.5796": 1008,
  "T.7308": 1009,
  "39XXXX": 1010,
  "G.1713": 1011,
  "A.6522": 1012,
  "T.1518": 1013,
  "X.2859": 1014,
  "G.5749": 1015,
  "G.3724": 1016,
  "T.2035": 1017,
  "T.2752": 1018,
  "X.4620": 1019,
  "C.5527": 1020,
  "T.6989": 1021,
  "X.4121": 1022,
  "T.1860": 1023,
  "G.4921": 1024,
  "C.1909": 1025,
  "A.5638": 1026,
  "C.6627": 1027,
  "T.8020": 1028,
  "A.5201": 1029,
  "T.3616": 1030,
  "C.8195": 1031,
  "X.7581": 1032,
  "T.3475": 1033,
  "X.5171": 1034,
  "T.5668": 1035,
  "A.2858": 1036,
  "A.5110": 1037,
  "G.9436": 1038,
  "T.5420": 1039,
  "C.1137": 1040,
  "A.6505": 1041,
  "A.1010": 1042,
  "T.8523": 1043,
  "T.5622": 1044,
  "X.8785": 1045,
  "G.6906": 1046,
  "C.8012": 1047,
  "X.8188": 1048,
  "X.2323": 1049,
  "X.2854": 1050,
  "X.3127": 1051,
  "T.2887": 1052,
  "G.4763": 1053,
  "X.2655": 1054,
  "X.7896": 1055,
  "T.8665": 1056,
  "C.6270": 1057,
  "T.672X": 1058,
  "T.3294": 1059,
  "C.3740": 1060,
  "C.2054": 1061,
  "G.4898": 1062,
  "A.3149": 1063,
  "T.4006": 1064,
  "G.4241": 1065,
  "X.8797": 1066,
  "T.7472": 1067,
  "T.2416": 1068,
  "T.5218": 1069,
  "T.7778": 1070,
  "G.8250": 1071,
  "C.5325": 1072,
  "X.8965": 1073,
  "C.7879": 1074,
  "A.6991": 1075,
  "G.9609": 1076,
  "A.2670": 1077,
  "X.4738": 1078,
  "X.7665": 1079,
  "C.7211": 1080,
  "G.2667": 1081,
  "C.7466": 1082,
  "A.1268": 1083,
  "G.188X": 1084,
  "X.4344": 1085,
  "C.6984": 1086,
  "G.9905": 1087,
  "C.1767": 1088,
  "G.7921": 1089,
  "G.9959": 1090,
  "A.2474": 1091,
  "A.9394": 1092,
  "X.926X": 1093,
  "A.176X": 1094,
  "A.7926": 1095,
  "A.2939": 1096,
  "X.8397": 1097,
  "T.3602": 1098,
  "C.6103": 1099,
  "G.6533": 1100,
  "G.6605": 1101,
  "T.9248": 1102,
  "C.9238": 1103,
  "T.4110": 1104,
  "C.8120": 1105,
  "T.5900": 1106,
  "G.6505": 1107,
  "A.9842": 1108,
  "T.8702": 1109,
  "G.8875": 1110,
  "A.1115": 1111,
  "C.9541": 1112,
  "A.1539": 1113,
  "T.3516": 1114,
  "A.9632": 1115,
  "G.6536": 1116,
  "A.4642": 1117,
  "C.7953": 1118,
  "T.2352": 1119,
  "666XXX": 1120,
  "G.6658": 1121,
  "T.6515": 1122,
  "X.5236": 1123,
  "X.33XX": 1124,
  "C.44XX": 1125,
  "T.8121": 1126,
  "838XXX": 1127,
  "A.1533": 1128,
  "959XXX": 1129,
  "A.9803": 1130,
  "G.3065": 1131,
  "A.1278": 1132,
  "T.2940": 1133,
  "C.4780": 1134,
  "A.9110": 1135,
  "A.988X": 1136,
  "A.3245": 1137,
  "C.4847": 1138,
  "A.5613": 1139,
  "G.2344": 1140,
  "A.3369": 1141,
  "A.4542": 1142,
  "A.6348": 1143,
  "T.8756": 1144,
  "X.2384": 1145,
  "A.2117": 1146,
  "A.706X": 1147,
  "C.6130": 1148,
  "C.9801": 1149,
  "G.5365": 1150,
  "G.8752": 1151,
  "T.7386": 1152,
  "A.6910": 1153,
  "G.1024": 1154,
  "C.7822": 1155,
  "G.8174": 1156,
  "A.6293": 1157,
  "159XXX": 1158,
  "A.6734": 1159,
  "X.7429": 1160,
  "T.395X": 1161,
  "X.6014": 1162,
  "93XXXX": 1163,
  "A.5818": 1164,
  "C.1410": 1165,
  "A.2363": 1166,
  "G.3679": 1167,
  "C.3737": 1168,
  "T.2154": 1169,
  "T.2714": 1170,
  "X.365X": 1171,
  "G.4032": 1172,
  "A.5380": 1173,
  "G.1041": 1174,
  "C.1235": 1175,
  "T.1709": 1176,
  "T.4971": 1177,
  "T.9390": 1178,
  "X.3568": 1179,
  "A.3071": 1180,
  "A.5141": 1181,
  "T.3960": 1182,
  "T.5158": 1183,
  "T.6609": 1184,
  "A.8593": 1185,
  "C.6966": 1186,
  "T.2221": 1187,
  "X.5958": 1188,
  "A.1703": 1189,
  "G.8382": 1190,
  "A.2587": 1191,
  "C.2616": 1192,
  "T.6850": 1193,
  "A.8659": 1194,
  "C.9903": 1195,
  "T.1604": 1196,
  "A.8449": 1197,
  "C.9349": 1198,
  "C.6922": 1199,
  "X.5853": 1200,
  "G.4426": 1201,
  "T.8041": 1202,
  "A.4383": 1203,
  "C.5505": 1204,
  "T.6250": 1205,
  "T.7010": 1206,
  "C.8352": 1207,
  "A.3113": 1208,
  "X.903X": 1209,
  "G.270X": 1210,
  "T.6098": 1211,
  "T.957X": 1212,
  "A.4381": 1213,
  "C.1264": 1214,
  "X.7287": 1215,
  "G.4893": 1216,
  "T.5100": 1217,
  "A.5864": 1218,
  "C.3311": 1219,
  "G.2474": 1220,
  "C.3185": 1221,
  "A.8482": 1222,
  "G.6556": 1223,
  "A.1527": 1224,
  "A.4426": 1225,
  "T.9382": 1226,
  "C.1296": 1227,
  "G.8287": 1228,
  "G.2859": 1229,
  "A.3264": 1230,
  "T.8870": 1231,
  "X.844X": 1232,
  "G.6802": 1233,
  "G.3072": 1234,
  "T.6496": 1235,
  "T.3746": 1236,
  "A.6954": 1237,
  "X.283X": 1238,
  "X.4576": 1239,
  "X.1318": 1240,
  "A.5753": 1241,
  "G.6991": 1242,
  "A.3333": 1243,
  "C.7846": 1244,
  "X.8650": 1245,
  "G.8204": 1246,
  "T.6278": 1247,
  "G.4246": 1248,
  "C.3563": 1249,
  "T.161X": 1250,
  "T.2009": 1251,
  "A.2839": 1252,
  "G.4201": 1253,
  "A.4942": 1254,
  "A.8211": 1255,
  "A.4961": 1256,
  "T.8643": 1257,
  "G.9543": 1258,
  "A.9574": 1259,
  "X.6152": 1260,
  "A.8350": 1261,
  "C.7519": 1262,
  "X.4126": 1263,
  "T.8628": 1264,
  "G.4107": 1265,
  "A.3937": 1266,
  "G.5566": 1267,
  "C.402X": 1268,
  "T.1744": 1269,
  "T.3724": 1270,
  "X.8060": 1271,
  "T.2486": 1272,
  "G.3414": 1273,
  "G.8947": 1274,
  "X.8506": 1275,
  "G.326X": 1276,
  "G.1487": 1277,
  "C.9020": 1278,
  "A.936X": 1279,
  "C.4979": 1280,
  "C.96XX": 1281,
  "G.1868": 1282,
  "A.6722": 1283,
  "A.3062": 1284,
  "A.3080": 1285,
  "T.6056": 1286,
  "C.9959": 1287,
  "T.1410": 1288,
  "X.5009": 1289,
  "C.4508": 1290,
  "C.6477": 1291,
  "C.2308": 1292,
  "G.949X": 1293,
  "C.654X": 1294,
  "C.1978": 1295,
  "A.5674": 1296,
  "T.3434": 1297,
  "X.1263": 1298,
  "C.604X": 1299,
  "X.2266": 1300,
  "A.1210": 1301,
  "T.5329": 1302,
  "A.3423": 1303,
  "T.6639": 1304,
  "X.8984": 1305,
  "G.8372": 1306,
  "C.9585": 1307,
  "C.7829": 1308,
  "T.5439": 1309,
  "T.6163": 1310,
  "X.2088": 1311,
  "A.2701": 1312,
  "G.753X": 1313,
  "X.6489": 1314,
  "G.8017": 1315,
  "X.8112": 1316,
  "C.3518": 1317,
  "G.8121": 1318,
  "G.9448": 1319,
  "A.6430": 1320,
  "X.2855": 1321,
  "G.2739": 1322,
  "T.2002": 1323,
  "X.2800": 1324,
  "G.5422": 1325,
  "T.5234": 1326,
  "G.6774": 1327,
  "A.2871": 1328,
  "C.3722": 1329,
  "A.9160": 1330,
  "G.2860": 1331,
  "G.2215": 1332,
  "T.8561": 1333,
  "G.8243": 1334,
  "X.6106": 1335,
  "G.6519": 1336,
  "C.8495": 1337,
  "C.3552": 1338,
  "X.7387": 1339,
  "T.2063": 1340,
  "T.9397": 1341,
  "T.4611": 1342,
  "X.7981": 1343,
  "C.2341": 1344,
  "C.5858": 1345,
  "C.3916": 1346,
  "A.8433": 1347,
  "T.731X": 1348,
  "T.7898": 1349,
  "C.6379": 1350,
  "X.5444": 1351,
  "G.1497": 1352,
  "T.6017": 1353,
  "T.9806": 1354,
  "T.2914": 1355,
  "A.3103": 1356,
  "C.2348": 1357,
  "X.7346": 1358,
  "G.925X": 1359,
  "C.9068": 1360,
  "G.3914": 1361,
  "G.6624": 1362,
  "A.3804": 1363,
  "G.2296": 1364,
  "T.2392": 1365,
  "G.6400": 1366,
  "C.7106": 1367,
  "G.6927": 1368,
  "T.1529": 1369,
  "T.5789": 1370,
  "X.4704": 1371,
  "G.2901": 1372,
  "A.6848": 1373,
  "X.9552": 1374,
  "A.8616": 1375,
  "G.7191": 1376,
  "C.3477": 1377,
  "A.1152": 1378,
  "X.954X": 1379,
  "C.1770": 1380,
  "G.4850": 1381,
  "X.9959": 1382,
  "X.5318": 1383,
  "T.7527": 1384,
  "A.1319": 1385,
  "A.7461": 1386,
  "X.6614": 1387,
  "T.7420": 1388,
  "T.8733": 1389,
  "C.960X": 1390,
  "X.4277": 1391,
  "T.5798": 1392,
  "A.6400": 1393,
  "G.9045": 1394,
  "T.796X": 1395,
  "G.9594": 1396,
  "G.954X": 1397,
  "A.5797": 1398,
  "G.4598": 1399,
  "C.2128": 1400,
  "X.8682": 1401,
  "A.8719": 1402,
  "C.7314": 1403,
  "T.727X": 1404,
  "T.7894": 1405,
  "X.951X": 1406,
  "T.4331": 1407,
  "X.6436": 1408,
  "X.9727": 1409,
  "C.8624": 1410,
  "A.8838": 1411,
  "C.4029": 1412,
  "T.583X": 1413,
  "A.8841": 1414,
  "C.4054": 1415,
  "C.9606": 1416,
  "C.4102": 1417,
  "T.5037": 1418,
  "X.1684": 1419,
  "C.508X": 1420,
  "T.5074": 1421,
  "G.619X": 1422,
  "400XXX": 1423,
  "X.1219": 1424,
  "A.9378": 1425,
  "G.6264": 1426,
  "A.5115": 1427,
  "T.4302": 1428,
  "G.42XX": 1429,
  "A.5407": 1430,
  "T.9014": 1431,
  "A.9616": 1432,
  "T.3511": 1433,
  "C.9612": 1434,
  "X.2682": 1435,
  "A.7337": 1436,
  "A.2101": 1437,
  "G.8466": 1438,
  "X.3671": 1439,
  "G.490X": 1440,
  "A.1827": 1441,
  "A.2414": 1442,
  "T.3644": 1443,
  "X.3278": 1444,
  "C.6332": 1445,
  "X.693X": 1446,
  "X.8726": 1447,
  "A.6272": 1448,
  "X.3920": 1449,
  "A.1110": 1450,
  "T.7280": 1451,
  "A.8363": 1452,
  "T.9255": 1453,
  "A.4374": 1454,
  "C.7778": 1455,
  "X.324X": 1456,
  "A.4371": 1457,
  "G.3268": 1458,
  "T.3828": 1459,
  "C.1943": 1460,
  "G.1775": 1461,
  "G.1278": 1462,
  "T.3412": 1463,
  "T.2859": 1464,
  "T.4643": 1465,
  "C.725X": 1466,
  "G.9986": 1467,
  "T.2115": 1468,
  "C.6993": 1469,
  "A.7671": 1470,
  "C.7899": 1471,
  "C.5641": 1472,
  "X.1139": 1473,
  "C.3175": 1474,
  "X.3337": 1475,
  "A.2722": 1476,
  "T.9608": 1477,
  "G.3813": 1478,
  "A.6220": 1479,
  "T.7583": 1480,
  "T.6507": 1481,
  "A.2766": 1482,
  "C.4475": 1483,
  "A.1262": 1484,
  "C.3288": 1485,
  "X.776X": 1486,
  "X.6921": 1487,
  "X.6293": 1488,
  "X.619X": 1489,
  "A.1180": 1490,
  "A.2688": 1491,
  "T.9720": 1492,
  "T.1020": 1493,
  "G.7278": 1494,
  "T.5114": 1495,
  "T.1887": 1496,
  "X.7741": 1497,
  "G.3968": 1498,
  "G.3704": 1499,
  "G.9420": 1500,
  "G.4215": 1501,
  "C.9275": 1502,
  "A.3412": 1503,
  "X.1016": 1504,
  "T.8471": 1505,
  "X.4209": 1506,
  "A.4885": 1507,
  "A.5715": 1508,
  "C.6046": 1509,
  "G.6602": 1510,
  "X.9821": 1511,
  "C.3520": 1512,
  "G.8663": 1513,
  "A.4831": 1514,
  "A.5238": 1515,
  "T.303X": 1516,
  "X.3060": 1517,
  "G.8849": 1518,
  "G.1504": 1519,
  "G.5991": 1520,
  "C.982X": 1521,
  "G.494X": 1522,
  "T.2511": 1523,
  "T.8047": 1524,
  "G.9248": 1525,
  "347XXX": 1526,
  "T.8744": 1527,
  "X.2980": 1528,
  "G.6094": 1529,
  "A.6223": 1530,
  "A.5607": 1531,
  "G.612X": 1532,
  "X.3692": 1533,
  "G.5572": 1534,
  "T.2910": 1535,
  "G.8385": 1536,
  "X.9336": 1537,
  "G.9845": 1538,
  "X.1712": 1539,
  "T.8260": 1540,
  "T.238X": 1541,
  "A.594X": 1542,
  "A.6961": 1543,
  "G.5525": 1544,
  "C.7373": 1545,
  "C.1496": 1546,
  "X.5260": 1547,
  "X.6664": 1548,
  "G.9994": 1549,
  "A.6130": 1550,
  "T.5011": 1551,
  "C.1917": 1552,
  "X.9642": 1553,
  "T.6990": 1554,
  "C.9847": 1555,
  "A.388X": 1556,
  "G.1158": 1557,
  "X.8792": 1558,
  "X.8353": 1559,
  "C.4325": 1560,
  "A.7470": 1561,
  "G.1837": 1562,
  "C.2264": 1563,
  "C.6105": 1564,
  "C.4565": 1565,
  "X.484X": 1566,
  "X.4650": 1567,
  "X.9586": 1568,
  "X.6821": 1569,
  "T.3246": 1570,
  "G.9438": 1571,
  "T.4736": 1572,
  "G.8215": 1573,
  "A.9438": 1574,
  "C.9511": 1575,
  "597XXX": 1576,
  "A.913X": 1577,
  "G.1176": 1578,
  "G.2651": 1579,
  "T.4040": 1580,
  "G.6516": 1581,
  "A.6829": 1582,
  "X.5464": 1583,
  "C.588X": 1584,
  "C.7442": 1585,
  "A.2284": 1586,
  "C.3900": 1587,
  "G.2150": 1588,
  "A.7348": 1589,
  "G.4791": 1590,
  "T.3222": 1591,
  "C.7317": 1592,
  "X.5630": 1593,
  "T.4738": 1594,
  "C.83XX": 1595,
  "T.4396": 1596,
  "X.4305": 1597,
  "T.9193": 1598,
  "G.8548": 1599,
  "X.5767": 1600,
  "C.7591": 1601,
  "X.3565": 1602,
  "63XXXX": 1603,
  "G.8330": 1604,
  "G.3866": 1605,
  "G.4472": 1606,
  "G.7814": 1607,
  "X.7763": 1608,
  "C.1815": 1609,
  "G.8092": 1610,
  "849XXX": 1611,
  "C.3088": 1612,
  "C.1992": 1613,
  "C.341X": 1614,
  "C.1295": 1615,
  "C.6827": 1616,
  "T.7521": 1617,
  "T.7007": 1618,
  "X.2868": 1619,
  "X.9838": 1620,
  "T.3122": 1621,
  "A.751X": 1622,
  "T.5892": 1623,
  "A.9038": 1624,
  "G.3740": 1625,
  "G.6029": 1626,
  "28XXXX": 1627,
  "A.2696": 1628,
  "T.677X": 1629,
  "A.7430": 1630,
  "T.2964": 1631,
  "T.6865": 1632,
  "C.2011": 1633,
  "T.4992": 1634,
  "C.230X": 1635,
  "A.9557": 1636,
  "T.6114": 1637,
  "989XXX": 1638,
  "X.9113": 1639,
  "A.3317": 1640,
  "A.7973": 1641,
  "C.7540": 1642,
  "G.2497": 1643,
  "G.144X": 1644,
  "T.8840": 1645,
  "G.7570": 1646,
  "X.1803": 1647,
  "T.8688": 1648,
  "T.1598": 1649,
  "C.8926": 1650,
  "X.9966": 1651,
  "C.5487": 1652,
  "G.8709": 1653,
  "G.7995": 1654,
  "T.7131": 1655,
  "T.4359": 1656,
  "T.2880": 1657,
  "A.9338": 1658,
  "C.244X": 1659,
  "A.2876": 1660,
  "T.2901": 1661,
  "G.3618": 1662,
  "C.9933": 1663,
  "G.5332": 1664,
  "C.5978": 1665,
  "T.1187": 1666,
  "C.5504": 1667,
  "G.6523": 1668,
  "A.3825": 1669,
  "T.5951": 1670,
  "G.7795": 1671,
  "X.8659": 1672,
  "T.1591": 1673,
  "C.5003": 1674,
  "A.8824": 1675,
  "X.6775": 1676,
  "C.3479": 1677,
  "G.2593": 1678,
  "G.6021": 1679,
  "A.4293": 1680,
  "T.5324": 1681,
  "C.6271": 1682,
  "G.8571": 1683,
  "A.9655": 1684,
  "C.7137": 1685,
  "G.4638": 1686,
  "A.5148": 1687,
  "T.1292": 1688,
  "X.9498": 1689,
  "A.9562": 1690,
  "C.5783": 1691,
  "C.718X": 1692,
  "G.1153": 1693,
  "X.3587": 1694,
  "A.189X": 1695,
  "A.490X": 1696,
  "X.4174": 1697,
  "G.7086": 1698,
  "T.9070": 1699,
  "T.1534": 1700,
  "C.9552": 1701,
  "A.9552": 1702,
  "T.2026": 1703,
  "X.2039": 1704,
  "X.3082": 1705,
  "T.5818": 1706,
  "G.2186": 1707,
  "A.8000": 1708,
  "T.9719": 1709,
  "49XXXX": 1710,
  "X.1240": 1711,
  "G.6790": 1712,
  "G.6970": 1713,
  "G.7377": 1714,
  "G.7371": 1715,
  "C.2452": 1716,
  "A.707X": 1717,
  "G.6993": 1718,
  "T.9274": 1719,
  "G.1569": 1720,
  "A.9170": 1721,
  "T.3184": 1722,
  "X.4637": 1723,
  "G.2383": 1724,
  "A.1043": 1725,
  "T.6892": 1726,
  "A.6850": 1727,
  "X.4812": 1728,
  "C.4099": 1729,
  "X.1233": 1730,
  "X.6671": 1731,
  "X.8970": 1732,
  "X.9375": 1733,
  "G.5781": 1734,
  "T.3646": 1735,
  "G.1350": 1736,
  "C.481X": 1737,
  "G.3676": 1738,
  "C.1877": 1739,
  "G.5172": 1740,
  "G.8622": 1741,
  "T.4785": 1742,
  "C.3263": 1743,
  "C.9758": 1744,
  "X.2910": 1745,
  "C.9784": 1746,
  "C.5930": 1747,
  "X.1995": 1748,
  "T.1176": 1749,
  "G.167X": 1750,
  "X.2413": 1751,
  "G.8391": 1752,
  "A.1373": 1753,
  "G.4074": 1754,
  "X.3560": 1755,
  "G.6851": 1756,
  "T.9533": 1757,
  "A.7381": 1758,
  "A.7413": 1759,
  "361XXX": 1760,
  "T.9626": 1761,
  "X.7029": 1762,
  "C.2273": 1763,
  "C.3166": 1764,
  "A.401X": 1765,
  "X.8204": 1766,
  "X.2753": 1767,
  "A.6069": 1768,
  "X.606X": 1769,
  "A.2235": 1770,
  "A.9908": 1771,
  "A.3096": 1772,
  "X.1583": 1773,
  "C.2945": 1774,
  "C.2805": 1775,
  "C.1497": 1776,
  "A.3426": 1777,
  "T.9779": 1778,
  "X.1145": 1779,
  "C.1681": 1780,
  "A.9335": 1781,
  "T.953X": 1782,
  "C.235X": 1783,
  "C.3448": 1784,
  "X.3934": 1785,
  "T.1903": 1786,
  "C.5129": 1787,
  "T.8972": 1788,
  "A.9643": 1789,
  "T.7822": 1790,
  "G.6185": 1791,
  "688XXX": 1792,
  "G.8436": 1793,
  "C.5356": 1794,
  "C.7871": 1795,
  "C.751X": 1796,
  "X.8606": 1797,
  "T.5984": 1798,
  "G.6362": 1799,
  "T.9494": 1800,
  "X.7527": 1801,
  "X.2075": 1802,
  "C.2219": 1803,
  "X.7172": 1804,
  "G.2081": 1805,
  "G.5904": 1806,
  "G.8083": 1807,
  "T.9249": 1808,
  "X.3712": 1809,
  "C.4298": 1810,
  "C.8479": 1811,
  "A.6235": 1812,
  "T.127X": 1813,
  "G.1732": 1814,
  "979XXX": 1815,
  "C.6843": 1816,
  "X.1355": 1817,
  "C.3101": 1818,
  "X.6333": 1819,
  "C.4989": 1820,
  "X.6855": 1821,
  "X.3113": 1822,
  "C.7686": 1823,
  "C.3446": 1824,
  "C.5035": 1825,
  "C.569X": 1826,
  "X.6959": 1827,
  "A.8025": 1828,
  "X.3452": 1829,
  "T.9057": 1830,
  "G.6830": 1831,
  "T.9159": 1832,
  "T.1824": 1833,
  "A.5815": 1834,
  "G.3364": 1835,
  "C.1752": 1836,
  "X.9248": 1837,
  "X.6209": 1838,
  "G.368X": 1839,
  "T.2259": 1840,
  "C.1293": 1841,
  "T.9131": 1842,
  "760XXX": 1843,
  "G.3084": 1844,
  "C.4064": 1845,
  "T.6815": 1846,
  "T.9455": 1847,
  "T.1609": 1848,
  "921XXX": 1849,
  "T.1350": 1850,
  "G.7336": 1851,
  "X.6504": 1852,
  "G.9078": 1853,
  "A.9779": 1854,
  "G.1883": 1855,
  "C.9494": 1856,
  "X.9772": 1857,
  "A.1325": 1858,
  "T.5780": 1859,
  "C.9880": 1860,
  "C.3665": 1861,
  "X.575X": 1862,
  "T.2458": 1863,
  "C.1261": 1864,
  "A.3527": 1865,
  "T.2826": 1866,
  "X.629X": 1867,
  "A.369X": 1868,
  "X.6801": 1869,
  "G.4597": 1870,
  "T.585X": 1871,
  "A.5402": 1872,
  "G.5457": 1873,
  "C.9562": 1874,
  "G.4265": 1875,
  "A.365X": 1876,
  "C.4500": 1877,
  "T.1400": 1878,
  "X.8590": 1879,
  "T.2979": 1880,
  "X.8252": 1881,
  "G.3696": 1882,
  "A.6202": 1883,
  "T.9167": 1884,
  "C.4596": 1885,
  "C.1349": 1886,
  "X.1915": 1887,
  "G.2311": 1888,
  "353XXX": 1889,
  "A.4825": 1890,
  "C.8985": 1891,
  "X.4500": 1892,
  "X.8571": 1893,
  "T.3171": 1894,
  "T.5537": 1895,
  "X.9901": 1896,
  "C.5344": 1897,
  "C.1834": 1898,
  "T.2807": 1899,
  "A.5897": 1900,
  "G.2673": 1901,
  "C.5968": 1902,
  "G.9686": 1903,
  "A.9067": 1904,
  "X.2441": 1905,
  "A.392X": 1906,
  "X.2679": 1907,
  "A.1546": 1908,
  "G.9430": 1909,
  "G.4920": 1910,
  "C.1949": 1911,
  "X.5631": 1912,
  "G.1515": 1913,
  "X.8489": 1914,
  "A.2227": 1915,
  "T.6457": 1916,
  "C.8724": 1917,
  "A.2584": 1918,
  "C.4248": 1919,
  "A.1805": 1920,
  "T.7833": 1921,
  "640XXX": 1922,
  "C.515X": 1923,
  "G.5697": 1924,
  "G.5911": 1925,
  "C.8344": 1926,
  "T.3809": 1927,
  "C.6808": 1928,
  "C.4809": 1929,
  "C.1630": 1930,
  "X.2651": 1931,
  "G.2729": 1932,
  "X.2819": 1933,
  "X.5973": 1934,
  "455XXX": 1935,
  "G.9262": 1936,
  "C.9063": 1937,
  "T.7254": 1938,
  "X.5658": 1939,
  "G.4023": 1940,
  "G.2221": 1941,
  "T.7574": 1942,
  "T.6058": 1943,
  "988XXX": 1944,
  "G.6346": 1945,
  "T.5436": 1946,
  "G.3016": 1947,
  "C.5140": 1948,
  "C.5516": 1949,
  "C.5809": 1950,
  "T.7891": 1951,
  "G.3869": 1952,
  "C.5544": 1953,
  "A.7233": 1954,
  "T.4930": 1955,
  "C.5062": 1956,
  "G.1383": 1957,
  "A.8069": 1958,
  "C.5249": 1959,
  "T.8544": 1960,
  "A.4669": 1961,
  "G.6813": 1962,
  "G.2847": 1963,
  "X.9971": 1964,
  "C.3953": 1965,
  "G.2537": 1966,
  "T.2843": 1967,
  "T.6910": 1968,
  "T.1297": 1969,
  "G.4533": 1970,
  "X.2785": 1971,
  "A.1204": 1972,
  "A.9077": 1973,
  "A.4045": 1974,
  "C.8556": 1975,
  "A.9149": 1976,
  "C.2147": 1977,
  "T.6644": 1978,
  "X.1853": 1979,
  "G.1418": 1980,
  "450XXX": 1981,
  "C.322X": 1982,
  "C.1945": 1983,
  "A.7691": 1984,
  "A.779X": 1985,
  "X.8415": 1986,
  "T.7173": 1987,
  "X.2957": 1988,
  "C.2646": 1989,
  "G.7046": 1990,
  "T.5934": 1991,
  "X.4672": 1992,
  "C.4589": 1993,
  "X.1300": 1994,
  "X.8133": 1995,
  "C.2310": 1996,
  "C.1214": 1997,
  "C.2793": 1998,
  "T.9169": 1999,
  "71XXXX": 2000,
  "G.8028": 2001,
  "C.9576": 2002,
  "A.8280": 2003,
  "C.8400": 2004,
  "T.8112": 2005,
  "G.3379": 2006,
  "C.7261": 2007,
  "G.973X": 2008,
  "C.1393": 2009,
  "T.7944": 2010,
  "T.6927": 2011,
  "X.8257": 2012,
  "451XXX": 2013,
  "X.8616": 2014,
  "T.1624": 2015,
  "T.4084": 2016,
  "630XXX": 2017,
  "G.8161": 2018,
  "G.215X": 2019,
  "T.2484": 2020,
  "T.5613": 2021,
  "A.154X": 2022,
  "G.9715": 2023,
  "X.8363": 2024,
  "A.8381": 2025,
  "X.4961": 2026,
  "A.1299": 2027,
  "T.7000": 2028,
  "A.6021": 2029,
  "A.6267": 2030,
  "C.5031": 2031,
  "A.8657": 2032,
  "A.3628": 2033,
  "G.4509": 2034,
  "G.4185": 2035,
  "T.4647": 2036,
  "X.8236": 2037,
  "A.6159": 2038,
  "A.7371": 2039,
  "G.5196": 2040,
  "T.3018": 2041,
  "T.4913": 2042,
  "C.3128": 2043,
  "G.7212": 2044,
  "C.7573": 2045,
  "T.2686": 2046,
  "T.3585": 2047,
  "C.5041": 2048,
  "A.5195": 2049,
  "G.6011": 2050,
  "A.3058": 2051,
  "X.2438": 2052,
  "C.7720": 2053,
  "T.6240": 2054,
  "G.7886": 2055,
  "X.3114": 2056,
  "G.3710": 2057,
  "A.8633": 2058,
  "G.2595": 2059,
  "A.7906": 2060,
  "X.8206": 2061,
  "672XXX": 2062,
  "A.1279": 2063,
  "C.753X": 2064,
  "G.8651": 2065,
  "A.8222": 2066,
  "G.1396": 2067,
  "T.1811": 2068,
  "A.3425": 2069,
  "A.5252": 2070,
  "X.6060": 2071,
  "X.9475": 2072,
  "G.5430": 2073,
  "X.4004": 2074,
  "T.3021": 2075,
  "T.8747": 2076,
  "A.6812": 2077,
  "G.9993": 2078,
  "A.1307": 2079,
  "A.2770": 2080,
  "X.6961": 2081,
  "T.907X": 2082,
  "G.5552": 2083,
  "A.3492": 2084,
  "G.7625": 2085,
  "C.148X": 2086,
  "A.7642": 2087,
  "X.6296": 2088,
  "A.2600": 2089,
  "G.7427": 2090,
  "C.9342": 2091,
  "930XXX": 2092,
  "G.1309": 2093,
  "C.2781": 2094,
  "T.327X": 2095,
  "C.7213": 2096,
  "G.7178": 2097,
  "G.2423": 2098,
  "T.4250": 2099,
  "G.7821": 2100,
  "C.1442": 2101,
  "A.1479": 2102,
  "G.3408": 2103,
  "G.3548": 2104,
  "A.9327": 2105,
  "C.2069": 2106,
  "C.9925": 2107,
  "055XXX": 2108,
  "X.4487": 2109,
  "C.5494": 2110,
  "G.5507": 2111,
  "X.2048": 2112,
  "T.600X": 2113,
  "A.1474": 2114,
  "G.3499": 2115,
  "G.5203": 2116,
  "T.7695": 2117,
  "X.7624": 2118,
  "G.2231": 2119,
  "G.3320": 2120,
  "A.5892": 2121,
  "C.385X": 2122,
  "T.9085": 2123,
  "X.7890": 2124,
  "G.1629": 2125,
  "X.4469": 2126,
  "C.9528": 2127,
  "X.4036": 2128,
  "A.7700": 2129,
  "C.8445": 2130,
  "A.9051": 2131,
  "C.780X": 2132,
  "C.8896": 2133,
  "G.9329": 2134,
  "C.3836": 2135,
  "C.1344": 2136,
  "C.1840": 2137,
  "C.9745": 2138,
  "A.5168": 2139,
  "G.9877": 2140,
  "G.6901": 2141,
  "A.768X": 2142,
  "X.948X": 2143,
  "T.1385": 2144,
  "T.1674": 2145,
  "X.8715": 2146,
  "A.7288": 2147,
  "T.7970": 2148,
  "A.1251": 2149,
  "G.152X": 2150,
  "G.4973": 2151,
  "A.929X": 2152,
  "G.3792": 2153,
  "X.1610": 2154,
  "A.2813": 2155,
  "T.4668": 2156,
  "C.7689": 2157,
  "C.7621": 2158,
  "C.5227": 2159,
  "A.9724": 2160,
  "C.8253": 2161,
  "872XXX": 2162,
  "G.1531": 2163,
  "X.5341": 2164,
  "C.9742": 2165,
  "309XXX": 2166,
  "T.1101": 2167,
  "T.8696": 2168,
  "X.2789": 2169,
  "T.9323": 2170,
  "A.9862": 2171,
  "T.7707": 2172,
  "C.6646": 2173,
  "A.5156": 2174,
  "T.819X": 2175,
  "A.8367": 2176,
  "X.1760": 2177,
  "T.4326": 2178,
  "C.5347": 2179,
  "G.6326": 2180,
  "C.3610": 2181,
  "016XXX": 2182,
  "T.4631": 2183,
  "X.1393": 2184,
  "268XXX": 2185,
  "C.9162": 2186,
  "T.6300": 2187,
  "T.9791": 2188,
  "G.7651": 2189,
  "T.8536": 2190,
  "T.2790": 2191,
  "G.7688": 2192,
  "X.9692": 2193,
  "G.2724": 2194,
  "X.5620": 2195,
  "T.1224": 2196,
  "X.4078": 2197,
  "X.1239": 2198,
  "X.8015": 2199,
  "G.6180": 2200,
  "A.9486": 2201,
  "T.3422": 2202,
  "T.7804": 2203,
  "T.5315": 2204,
  "A.1270": 2205,
  "C.5746": 2206,
  "X.9850": 2207,
  "C.8933": 2208,
  "G.2079": 2209,
  "X.3327": 2210,
  "G.2004": 2211,
  "A.403X": 2212,
  "X.9258": 2213,
  "T.5731": 2214,
  "X.8964": 2215,
  "G.3010": 2216,
  "X.7279": 2217,
  "X.7732": 2218,
  "C.6785": 2219,
  "T.3160": 2220,
  "C.3864": 2221,
  "T.8700": 2222,
  "T.9201": 2223,
  "G.1245": 2224,
  "X.233X": 2225,
  "X.7474": 2226,
  "G.8380": 2227,
  "C.2645": 2228,
  "A.2943": 2229,
  "G.7477": 2230,
  "C.6839": 2231,
  "T.7176": 2232,
  "A.9012": 2233,
  "X.1345": 2234,
  "T.1017": 2235,
  "611XXX": 2236,
  "G.9198": 2237,
  "X.4768": 2238,
  "T.8371": 2239,
  "G.8209": 2240,
  "X.1982": 2241,
  "G.2163": 2242,
  "G.9961": 2243,
  "X.3667": 2244,
  "T.2636": 2245,
  "X.846X": 2246,
  "A.2139": 2247,
  "G.4535": 2248,
  "G.8579": 2249,
  "A.7071": 2250,
  "G.9207": 2251,
  "C.1291": 2252,
  "C.8709": 2253,
  "X.7844": 2254,
  "C.2619": 2255,
  "C.2855": 2256,
  "A.6413": 2257,
  "505XXX": 2258,
  "X.159X": 2259,
  "G.2116": 2260,
  "A.3955": 2261,
  "T.8366": 2262,
  "T.6953": 2263,
  "C.7439": 2264,
  "G.3644": 2265,
  "A.7504": 2266,
  "X.5382": 2267,
  "T.2934": 2268,
  "A.9107": 2269,
  "G.3416": 2270,
  "C.9139": 2271,
  "A.4698": 2272,
  "G.593X": 2273,
  "X.4663": 2274,
  "G.8487": 2275,
  "T.718X": 2276,
  "X.8299": 2277,
  "T.2434": 2278,
  "G.4371": 2279,
  "C.5607": 2280,
  "C.5200": 2281,
  "T.7431": 2282,
  "A.6907": 2283,
  "G.7391": 2284,
  "C.8943": 2285,
  "G.9216": 2286,
  "X.3040": 2287,
  "G.8672": 2288,
  "C.9846": 2289,
  "X.4151": 2290,
  "G.3283": 2291,
  "X.5046": 2292,
  "C.6605": 2293,
  "X.6653": 2294,
  "X.4629": 2295,
  "C.3858": 2296,
  "X.3438": 2297,
  "X.7564": 2298,
  "X.3158": 2299,
  "T.2300": 2300,
  "A.4340": 2301,
  "C.7160": 2302,
  "G.733X": 2303,
  "G.5700": 2304,
  "G.2865": 2305,
  "G.9969": 2306,
  "T.6941": 2307,
  "A.5985": 2308,
  "X.3025": 2309,
  "A.7941": 2310,
  "A.9280": 2311,
  "X.2471": 2312,
  "A.6512": 2313,
  "C.9348": 2314,
  "T.6406": 2315,
  "X.4840": 2316,
  "T.5538": 2317,
  "C.2046": 2318,
  "X.5283": 2319,
  "A.4605": 2320,
  "X.1682": 2321,
  "G.773X": 2322,
  "C.2791": 2323,
  "A.2763": 2324,
  "X.5588": 2325,
  "G.748X": 2326,
  "T.8938": 2327,
  "A.236X": 2328,
  "A.9214": 2329,
  "A.1400": 2330,
  "G.4355": 2331,
  "A.5998": 2332,
  "G.2208": 2333,
  "T.7704": 2334,
  "G.849X": 2335,
  "G.7262": 2336,
  "G.2381": 2337,
  "T.7881": 2338,
  "963XXX": 2339,
  "C.7539": 2340,
  "G.3292": 2341,
  "C.1676": 2342,
  "X.3639": 2343,
  "C.9038": 2344,
  "C.9818": 2345,
  "T.2626": 2346,
  "X.3503": 2347,
  "X.7109": 2348,
  "X.659X": 2349,
  "X.7070": 2350,
  "G.4639": 2351,
  "T.3049": 2352,
  "G.7901": 2353,
  "X.9251": 2354,
  "C.8639": 2355,
  "G.6153": 2356,
  "T.7307": 2357,
  "T.3706": 2358,
  "X.5719": 2359,
  "X.1203": 2360,
  "A.285X": 2361,
  "197XXX": 2362,
  "T.3369": 2363,
  "X.2509": 2364,
  "A.911X": 2365,
  "A.4404": 2366,
  "G.1881": 2367,
  "G.1124": 2368,
  "858XXX": 2369,
  "T.159X": 2370,
  "T.2884": 2371,
  "X.4787": 2372,
  "T.1083": 2373,
  "A.5446": 2374,
  "C.5794": 2375,
  "G.2973": 2376,
  "C.6952": 2377,
  "C.154X": 2378,
  "T.4043": 2379,
  "T.6397": 2380,
  "X.535X": 2381,
  "T.5001": 2382,
  "T.6000": 2383,
  "A.6999": 2384,
  "A.9085": 2385,
  "G.380X": 2386,
  "C.870X": 2387,
  "T.2761": 2388,
  "A.3853": 2389,
  "X.6428": 2390,
  "C.1874": 2391,
  "T.311X": 2392,
  "T.371X": 2393,
  "A.1349": 2394,
  "A.5343": 2395,
  "C.9497": 2396,
  "X.3179": 2397,
  "A.8386": 2398,
  "T.9329": 2399,
  "T.7871": 2400,
  "X.7765": 2401,
  "C.2151": 2402,
  "A.1656": 2403,
  "X.6063": 2404,
  "G.1025": 2405,
  "T.6526": 2406,
  "A.2667": 2407,
  "C.636X": 2408,
  "X.6758": 2409,
  "C.5874": 2410,
  "T.9477": 2411,
  "T.8730": 2412,
  "T.2301": 2413,
  "C.706X": 2414,
  "G.7288": 2415,
  "C.3019": 2416,
  "X.1359": 2417,
  "T.1732": 2418,
  "X.4746": 2419,
  "C.518X": 2420,
  "G.5916": 2421,
  "G.489X": 2422,
  "T.9829": 2423,
  "T.6523": 2424,
  "T.1665": 2425,
  "C.5145": 2426,
  "G.140X": 2427,
  "C.931X": 2428,
  "C.7010": 2429,
  "T.5591": 2430,
  "G.7264": 2431,
  "G.1999": 2432,
  "175XXX": 2433,
  "X.1841": 2434,
  "A.9647": 2435,
  "X.9685": 2436,
  "G.1384": 2437,
  "T.9140": 2438,
  "G.3492": 2439,
  "A.7450": 2440,
  "T.6484": 2441,
  "X.3572": 2442,
  "C.3666": 2443,
  "G.7642": 2444,
  "A.4464": 2445,
  "T.457X": 2446,
  "G.3437": 2447,
  "X.7406": 2448,
  "C.4620": 2449,
  "X.3403": 2450,
  "T.304X": 2451,
  "X.9294": 2452,
  "X.4049": 2453,
  "X.8852": 2454,
  "C.2582": 2455,
  "C.1982": 2456,
  "G.3755": 2457,
  "T.6121": 2458,
  "G.4377": 2459,
  "C.8063": 2460,
  "A.462X": 2461,
  "657XXX": 2462,
  "A.8038": 2463,
  "G.6212": 2464,
  "A.9037": 2465,
  "G.8035": 2466,
  "T.2787": 2467,
  "C.648X": 2468,
  "C.219X": 2469,
  "X.3443": 2470,
  "X.8333": 2471,
  "C.1988": 2472,
  "G.9033": 2473,
  "X.2658": 2474,
  "T.5071": 2475,
  "X.4040": 2476,
  "950XXX": 2477,
  "T.8909": 2478,
  "X.5820": 2479,
  "G.3983": 2480,
  "T.8590": 2481,
  "C.7786": 2482,
  "T.7662": 2483,
  "X.9655": 2484,
  "X.7073": 2485,
  "X.439X": 2486,
  "X.8326": 2487,
  "X.7552": 2488,
  "T.8093": 2489,
  "G.9246": 2490,
  "A.3931": 2491,
  "X.2929": 2492,
  "A.5678": 2493,
  "T.9577": 2494,
  "A.9968": 2495,
  "X.4760": 2496,
  "T.2878": 2497,
  "G.8213": 2498,
  "G.4346": 2499,
  "G.3908": 2500,
  "G.8253": 2501,
  "X.7574": 2502,
  "C.2573": 2503,
  "A.5698": 2504,
  "C.134X": 2505,
  "T.5161": 2506,
  "T.8498": 2507,
  "T.5930": 2508,
  "X.4185": 2509,
  "G.3009": 2510,
  "G.952X": 2511,
  "X.9926": 2512,
  "T.6701": 2513,
  "X.4463": 2514,
  "T.4178": 2515,
  "C.5050": 2516,
  "G.2308": 2517,
  "X.2212": 2518,
  "X.1859": 2519,
  "C.4524": 2520,
  "C.5534": 2521,
  "G.7038": 2522,
  "T.218X": 2523,
  "T.5948": 2524,
  "C.4000": 2525,
  "T.7601": 2526,
  "X.7269": 2527,
  "G.3777": 2528,
  "X.5185": 2529,
  "X.9112": 2530,
  "T.8125": 2531,
  "T.6745": 2532,
  "A.246X": 2533,
  "X.5949": 2534,
  "A.4417": 2535,
  "G.1586": 2536,
  "G.5620": 2537,
  "C.2267": 2538,
  "G.2443": 2539,
  "T.5903": 2540,
  "A.2824": 2541,
  "T.1907": 2542,
  "G.8333": 2543,
  "G.170X": 2544,
  "G.1820": 2545,
  "T.4561": 2546,
  "A.6029": 2547,
  "T.8410": 2548,
  "G.8646": 2549,
  "G.2457": 2550,
  "T.6761": 2551,
  "A.6736": 2552,
  "A.5548": 2553,
  "T.5293": 2554,
  "G.7587": 2555,
  "C.9796": 2556,
  "T.3713": 2557,
  "C.7365": 2558,
  "X.5847": 2559,
  "X.6441": 2560,
  "T.5312": 2561,
  "A.9060": 2562,
  "A.586X": 2563,
  "744XXX": 2564,
  "A.3403": 2565,
  "C.2483": 2566,
  "A.4718": 2567,
  "A.72XX": 2568,
  "X.5364": 2569,
  "X.5560": 2570,
  "G.3944": 2571,
  "G.4713": 2572,
  "X.1678": 2573,
  "X.3805": 2574,
  "A.7546": 2575,
  "G.6317": 2576,
  "G.8029": 2577,
  "G.9925": 2578,
  "G.9244": 2579,
  "X.6262": 2580,
  "C.6309": 2581,
  "G.2480": 2582,
  "T.8961": 2583,
  "G.7621": 2584,
  "C.8438": 2585,
  "A.4816": 2586,
  "T.7512": 2587,
  "C.9540": 2588,
  "G.2153": 2589,
  "T.5143": 2590,
  "X.5771": 2591,
  "869XXX": 2592,
  "G.5478": 2593,
  "G.831X": 2594,
  "A.2361": 2595,
  "T.2023": 2596,
  "A.2952": 2597,
  "A.6908": 2598,
  "G.1480": 2599,
  "T.8419": 2600,
  "T.1067": 2601,
  "X.5140": 2602,
  "X.8702": 2603,
  "G.8683": 2604,
  "G.5630": 2605,
  "A.5847": 2606,
  "C.3950": 2607,
  "C.4152": 2608,
  "X.9494": 2609,
  "T.3064": 2610,
  "X.4172": 2611,
  "C.5671": 2612,
  "C.7790": 2613,
  "G.8006": 2614,
  "C.436X": 2615,
  "A.9044": 2616,
  "T.3421": 2617,
  "T.8787": 2618,
  "T.290X": 2619,
  "T.2091": 2620,
  "T.382X": 2621,
  "G.1004": 2622,
  "T.1802": 2623,
  "A.2948": 2624,
  "C.7773": 2625,
  "G.6229": 2626,
  "G.1602": 2627,
  "C.8842": 2628,
  "A.9457": 2629,
  "G.27XX": 2630,
  "X.4089": 2631,
  "T.4564": 2632,
  "A.4986": 2633,
  "G.420X": 2634,
  "X.8561": 2635,
  "X.3853": 2636,
  "A.6483": 2637,
  "X.6832": 2638,
  "X.944X": 2639,
  "A.1080": 2640,
  "X.7941": 2641,
  "G.5303": 2642,
  "T.7079": 2643,
  "C.151X": 2644,
  "A.6038": 2645,
  "G.4497": 2646,
  "A.2849": 2647,
  "T.3496": 2648,
  "T.80XX": 2649,
  "C.5137": 2650,
  "T.6469": 2651,
  "G.7719": 2652,
  "X.2066": 2653,
  "C.9841": 2654,
  "C.55XX": 2655,
  "X.4175": 2656,
  "C.8010": 2657,
  "X.7386": 2658,
  "A.5055": 2659,
  "G.2267": 2660,
  "T.9213": 2661,
  "G.8719": 2662,
  "G.9058": 2663,
  "A.3778": 2664,
  "G.5954": 2665,
  "T.2503": 2666,
  "X.8780": 2667,
  "T.8068": 2668,
  "123XXX": 2669,
  "T.5894": 2670,
  "C.7618": 2671,
  "C.1338": 2672,
  "A.207X": 2673,
  "X.9383": 2674,
  "G.7924": 2675,
  "X.2553": 2676,
  "C.8348": 2677,
  "C.6364": 2678,
  "A.745X": 2679,
  "X.7717": 2680,
  "G.1327": 2681,
  "G.2740": 2682,
  "C.8502": 2683,
  "A.6309": 2684,
  "T.8878": 2685,
  "C.6805": 2686,
  "X.9465": 2687,
  "T.8226": 2688,
  "C.7293": 2689,
  "G.2362": 2690,
  "C.2935": 2691,
  "T.3289": 2692,
  "A.5651": 2693,
  "G.7672": 2694,
  "G.9704": 2695,
  "X.9362": 2696,
  "T.4778": 2697,
  "X.8767": 2698,
  "C.3812": 2699,
  "C.1404": 2700,
  "A.2409": 2701,
  "X.3035": 2702,
  "A.1886": 2703,
  "T.8965": 2704,
  "C.5715": 2705,
  "X.4166": 2706,
  "A.6978": 2707,
  "X.6767": 2708,
  "C.8999": 2709,
  "C.5277": 2710,
  "X.5104": 2711,
  "X.5428": 2712,
  "T.6707": 2713,
  "A.7188": 2714,
  "214XXX": 2715,
  "G.7699": 2716,
  "G.9219": 2717,
  "T.4221": 2718,
  "G.7044": 2719,
  "G.8969": 2720,
  "C.9183": 2721,
  "X.9373": 2722,
  "T.4917": 2723,
  "A.959X": 2724,
  "G.8655": 2725,
  "C.8638": 2726,
  "T.7315": 2727,
  "G.640X": 2728,
  "X.8475": 2729,
  "T.4538": 2730,
  "X.8285": 2731,
  "C.4718": 2732,
  "C.6622": 2733,
  "T.6971": 2734,
  "T.6739": 2735,
  "C.8052": 2736,
  "X.9797": 2737,
  "X.3102": 2738,
  "T.1407": 2739,
  "A.6496": 2740,
  "X.1696": 2741,
  "G.7216": 2742,
  "X.8627": 2743,
  "X.8859": 2744,
  "X.184X": 2745,
  "T.5713": 2746,
  "T.9914": 2747,
  "C.3461": 2748,
  "G.3810": 2749,
  "A.6804": 2750,
  "T.1062": 2751,
  "C.1303": 2752,
  "C.1378": 2753,
  "T.5226": 2754,
  "X.7221": 2755,
  "387XXX": 2756,
  "X.3109": 2757,
  "C.4043": 2758,
  "X.3699": 2759,
  "G.4350": 2760,
  "X.180X": 2761,
  "G.8974": 2762,
  "X.616X": 2763,
  "X.5398": 2764,
  "T.784X": 2765,
  "C.8790": 2766,
  "X.6934": 2767,
  "G.5004": 2768,
  "C.4765": 2769,
  "T.6304": 2770,
  "G.5949": 2771,
  "C.5312": 2772,
  "C.2311": 2773,
  "X.9717": 2774,
  "A.557X": 2775,
  "X.4114": 2776,
  "A.9041": 2777,
  "C.3926": 2778,
  "X.2806": 2779,
  "C.7171": 2780,
  "A.2054": 2781,
  "A.1412": 2782,
  "C.3047": 2783,
  "X.9737": 2784,
  "T.3014": 2785,
  "C.3319": 2786,
  "T.3498": 2787,
  "A.7561": 2788,
  "A.9317": 2789,
  "X.1031": 2790,
  "G.3248": 2791,
  "T.1628": 2792,
  "A.817X": 2793,
  "T.6821": 2794,
  "G.4967": 2795,
  "T.1483": 2796,
  "T.2628": 2797,
  "X.8626": 2798,
  "X.7416": 2799,
  "A.4004": 2800,
  "X.5142": 2801,
  "A.9323": 2802,
  "C.2818": 2803,
  "C.9198": 2804,
  "X.4652": 2805,
  "X.4764": 2806,
  "C.4404": 2807,
  "G.7143": 2808,
  "117XXX": 2809,
  "T.944X": 2810,
  "A.6241": 2811,
  "T.8142": 2812,
  "507XXX": 2813,
  "T.5029": 2814,
  "T.3026": 2815,
  "644XXX": 2816,
  "C.514X": 2817,
  "G.4151": 2818,
  "C.2710": 2819,
  "G.5846": 2820,
  "X.8214": 2821,
  "A.2044": 2822,
  "T.7149": 2823,
  "A.7096": 2824,
  "T.861X": 2825,
  "C.1621": 2826,
  "G.9992": 2827,
  "X.9825": 2828,
  "488XXX": 2829,
  "T.7604": 2830,
  "C.4562": 2831,
  "A.441X": 2832,
  "A.4161": 2833,
  "T.3455": 2834,
  "A.9167": 2835,
  "G.3712": 2836,
  "A.5330": 2837,
  "C.3855": 2838,
